{
  "outdoor_activities": {
    "sections": [
      {
        "8": {
          "section": "Painting",
          "categories": {
            "8.1": {
              "category": "Exterior Wall",
              "activities": {
                "8.1.1": {
                  "activity": "Masonry Painting (Two Coats on a Single-Story Building)",
                  "description": "Application of two coats of paint on masonry surfaces of a single-story building. This service includes surface preparation, application of primer, and two coats of paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a durable and aesthetically pleasing finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.2": {
                  "activity": "Exterior Wood Stain Painting (Single-Story Building)",
                  "description": "Staining of exterior wood surfaces on a single-story building. This service includes surface preparation, application of wood stain, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Enhances the natural beauty of wood while providing protection.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.3": {
                  "activity": "Masonry Painting (One Coat on a Single-Story Building)",
                  "description": "Application of one coat of paint on masonry surfaces of a single-story building. This service includes surface preparation and application of primer and paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Provides a protective and visually appealing finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.4": {
                  "activity": "Exterior Wood Painting (Two Coats on a Single-Story Building)",
                  "description": "Application of two coats of paint on exterior wood surfaces of a single-story building. This service includes surface preparation, application of primer, and two coats of paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a long-lasting and attractive finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.5": {
                  "activity": "Wood Shingle Staining (Two Coats on a Single-Story Building)",
                  "description": "Staining of wood shingles on a single-story building with two coats. This service includes surface preparation, application of wood stain, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Protects and beautifies wood shingles.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.6": {
                  "activity": "Masonry Painting (Two Coats on a 2-3 Story Building)",
                  "description": "Application of two coats of paint on masonry surfaces of a 2-3 story building. This service includes surface preparation, application of primer, and two coats of paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a durable and visually appealing finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.7": {
                  "activity": "Exterior Wood Stain Painting (2-3 Story Building)",
                  "description": "Staining of exterior wood surfaces on a 2-3 story building. This service includes surface preparation, application of wood stain, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Enhances the natural beauty of wood and provides protection on taller buildings.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.8": {
                  "activity": "Masonry Painting (One Coat on a 2-3 Story Building)",
                  "description": "Application of one coat of paint on masonry surfaces of a 2-3 story building. This service includes surface preparation and application of primer and paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Provides a protective and visually appealing finish on taller buildings.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.9": {
                  "activity": "Exterior Wood Painting (Two Coats on a 2-3 Story Building)",
                  "description": "Application of two coats of paint on exterior wood surfaces of a 2-3 story building. This service includes surface preparation, application of primer, and two coats of paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a long-lasting and attractive finish on taller buildings.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.10": {
                  "activity": "Wood Shingle Painting (Two Coats on a 2-3 Story Building)",
                  "description": "Painting of wood shingles on a 2-3 story building with two coats. This service includes surface preparation, application of primer, and two coats of paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Protects and beautifies wood shingles on taller buildings.",
                  "unit_of_measurement": "sq ft"
                },
                "8.1.11": {
                  "activity": "High-Rise Painting (Up to 60 Feet or Difficult-to-Reach Areas of the Building)",
                  "description": "Painting of high-rise buildings or difficult-to-reach areas up to 60 feet. This service includes surface preparation, application of primer, and paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a professional and durable finish on challenging areas.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "8.2": {
              "category": "Fence",
              "activities": {
                "8.2.1": {
                  "activity": "Ornamental Fence Priming and Painting",
                  "description": "Priming and painting of ornamental fences to enhance durability and appearance. This service includes surface preparation, application of primer, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Provides a protective and aesthetic finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.2.2": {
                  "activity": "Wood Fence or Gate Staining",
                  "description": "Staining of wood fences or gates to protect and beautify the wood. This service includes surface preparation and application of wood stain. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Enhances the natural look of wood and provides protection.",
                  "unit_of_measurement": "sq ft"
                },
                "8.2.3": {
                  "activity": "Wood Fence or Gate Sealing and Painting",
                  "description": "Sealing and painting of wood fences or gates to ensure longevity and visual appeal. This service includes surface preparation, application of sealer, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a durable and attractive finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.2.4": {
                  "activity": "Wood Fence Post Painting and Finishing",
                  "description": "Painting and finishing of wood fence posts to protect and enhance their appearance. This service includes surface preparation, priming, painting, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Provides a long-lasting and appealing finish.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "8.3": {
              "category": "Deck",
              "activities": {
                "8.3.1": {
                  "activity": "Deck Staining and Finishing",
                  "description": "Staining and finishing of decks to protect and enhance their appearance. This service includes surface preparation, application of wood stain, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Ensures a durable and attractive deck finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.3.2": {
                  "activity": "Deck Coating (Acrylic Polymer)",
                  "description": "Application of an acrylic polymer coating to decks for protection and improved appearance. This service includes surface preparation and application of the coating. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of coating type). Provides a protective and visually appealing deck surface.",
                  "unit_of_measurement": "sq ft"
                },
                "8.3.3": {
                  "activity": "Deck Painting (One Coat)",
                  "description": "Painting of decks with one coat of paint to refresh and protect the surface. This service includes surface preparation, priming, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a renewed and attractive deck finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.3.4": {
                  "activity": "Deck Priming and Painting",
                  "description": "Priming and painting of decks to ensure a durable and visually pleasing finish. This service includes surface preparation, application of primer, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Provides long-lasting protection and an appealing look.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "8.4": {
              "category": "Window Trim",
              "activities": {
                "8.4.1": {
                  "activity": "Window Trim & Jamb Painting",
                  "description": "Painting of window trim and jamb to enhance appearance and protect the surfaces. This service includes surface preparation, priming, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a durable and attractive finish.",
                  "unit_of_measurement": "each"
                },
                "8.4.2": {
                  "activity": "Window Trim and Jamb Staining and Finishing",
                  "description": "Staining and finishing of window trim and jamb to enhance the natural beauty of the wood. This service includes surface preparation, application of wood stain, and sealing. Includes comprehensive labor, materials, equipment usage, and finishes (client's choice of stain color and type). Provides a protective and aesthetically pleasing finish.",
                  "unit_of_measurement": "each"
                },
                "8.4.3": {
                  "activity": "Window Trim Painting: One Coat",
                  "description": "Painting of window trim with one coat to refresh and protect the surface. This service includes surface preparation, priming, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a renewed and attractive window trim finish.",
                  "unit_of_measurement": "lin ft"
                }
              }
            },
            "8.5": {
              "category": "Doors",
              "activities": {
                "8.5.1": {
                  "activity": "Door Slab Priming and Painting",
                  "description": "Priming and painting of door slabs to enhance appearance and protect the surface. This service includes surface preparation, application of primer, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a durable and attractive finish.",
                  "unit_of_measurement": "each"
                },
                "8.5.2": {
                  "activity": "French Door Slab Priming and Painting",
                  "description": "Priming and painting of French door slabs for improved aesthetics and protection. This service includes surface preparation, application of primer, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Provides a stylish and protective finish.",
                  "unit_of_measurement": "each"
                },
                "8.5.3": {
                  "activity": "Door Slab Staining and Finishing",
                  "description": "Staining and finishing of door slabs to highlight the natural beauty of the wood. This service includes surface preparation, application of wood stain, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Enhances the wood's natural look and provides protection.",
                  "unit_of_measurement": "each"
                },
                "8.5.4": {
                  "activity": "French Door Staining and Finishing",
                  "description": "Staining and finishing of French doors to enhance their natural beauty and durability. This service includes surface preparation, application of wood stain, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Ensures a durable and appealing finish.",
                  "unit_of_measurement": "each"
                },
                "8.5.5": {
                  "activity": "Single Garage Door Opening and Trim Sealing and Painting",
                  "description": "Sealing and painting of single garage door openings and trims for protection and improved appearance. This service includes surface preparation, application of sealer, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a protective and attractive finish.",
                  "unit_of_measurement": "each"
                },
                "8.5.6": {
                  "activity": "Single Garage Door Painting (One Coat)",
                  "description": "Painting of single garage doors with one coat to refresh and protect the surface. This service includes surface preparation, priming, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a renewed and appealing garage door finish.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "8.6": {
              "category": "Shutter",
              "activities": {
                "8.6.1": {
                  "activity": "Window Shutter Finishing",
                  "description": "Finishing of window shutters to enhance appearance and protect the surface. This service includes surface preparation, application of finishes, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of finish type). Ensures a durable and attractive shutter finish.",
                  "unit_of_measurement": "set"
                },
                "8.6.2": {
                  "activity": "Window Shutter Painting",
                  "description": "Painting of window shutters to refresh and protect the surface. This service includes surface preparation, priming, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Provides a renewed and appealing shutter finish.",
                  "unit_of_measurement": "set"
                },
                "8.6.3": {
                  "activity": "Window Shutter Staining and Finishing",
                  "description": "Staining and finishing of window shutters to enhance the natural beauty and durability of the wood. This service includes surface preparation, application of wood stain, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Ensures a protective and attractive shutter finish.",
                  "unit_of_measurement": "set"
                }
              }
            },
            "8.7": {
              "category": "Trim",
              "activities": {
                "8.7.1": {
                  "activity": "Trim Painting with One Coat",
                  "description": "Painting of trims with one coat to refresh and protect the surface. This service includes surface preparation, priming, and painting. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of color and type of paint). Ensures a renewed and appealing trim finish.",
                  "unit_of_measurement": "lin ft"
                },
                "8.7.2": {
                  "activity": "Trim Staining and Finishing",
                  "description": "Staining and finishing of trims to highlight the natural beauty of the wood. This service includes surface preparation, application of wood stain, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Enhances the wood's natural look and provides protection.",
                  "unit_of_measurement": "lin ft"
                }
              }
            },
            "8.8": {
              "category": "Stucco",
              "activities": {
                "8.8.1": {
                  "activity": "Stucco Acrylic Latex Painting",
                  "description": "Painting of stucco surfaces using acrylic latex paint to enhance appearance and protection. This service includes surface preparation, application of primer, and painting with acrylic latex paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of paint color and type). Ensures a durable and attractive stucco finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.8.2": {
                  "activity": "Stucco Elastomeric Painting",
                  "description": "Painting of stucco surfaces using elastomeric paint for enhanced durability and flexibility. This service includes surface preparation, application of primer, and painting with elastomeric paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of paint color and type). Provides a flexible and long-lasting finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.8.3": {
                  "activity": "Stucco Masonry Painting",
                  "description": "Painting of stucco surfaces with masonry paint for improved protection and appearance. This service includes surface preparation, application of primer, and painting with masonry paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of paint color and type). Ensures a strong and appealing stucco finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.8.4": {
                  "activity": "Stucco Lime Washing",
                  "description": "Lime washing of stucco surfaces to create a traditional, breathable finish. This service includes surface preparation and application of lime wash. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of lime wash color and type). Provides a natural and breathable stucco finish.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "8.9": {
              "category": "Brick",
              "activities": {
                "8.9.1": {
                  "activity": "Brick Acrylic Latex Painting",
                  "description": "Painting of brick surfaces using acrylic latex paint to enhance appearance and protection. This service includes surface preparation, application of primer, and painting with acrylic latex paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of paint color and type). Ensures a durable and attractive brick finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.9.2": {
                  "activity": "Brick Elastomeric Painting",
                  "description": "Painting of brick surfaces using elastomeric paint for enhanced durability and flexibility. This service includes surface preparation, application of primer, and painting with elastomeric paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of paint color and type). Provides a flexible and long-lasting finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.9.3": {
                  "activity": "Brick Masonry Painting",
                  "description": "Painting of brick surfaces with masonry paint for improved protection and appearance. This service includes surface preparation, application of primer, and painting with masonry paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of paint color and type). Ensures a strong and appealing brick finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.9.4": {
                  "activity": "Brick Lime Washing",
                  "description": "Lime washing of brick surfaces to create a traditional, breathable finish. This service includes surface preparation and application of lime wash. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of lime wash color and type). Provides a natural and breathable brick finish.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "8.10": {
              "category": "Concrete",
              "activities": {
                "8.10.1": {
                  "activity": "Concrete Epoxy Painting",
                  "description": "Painting of concrete surfaces using epoxy paint for enhanced durability and resistance. This service includes surface preparation, application of primer, and painting with epoxy paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of paint color and type). Ensures a strong and durable concrete finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.10.2": {
                  "activity": "Concrete Acrylic Latex Painting",
                  "description": "Painting of concrete surfaces using acrylic latex paint to enhance appearance and protection. This service includes surface preparation, application of primer, and painting with acrylic latex paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of paint color and type). Provides a durable and attractive concrete finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.10.3": {
                  "activity": "Concrete Masonry Painting",
                  "description": "Painting of concrete surfaces with masonry paint for improved protection and appearance. This service includes surface preparation, application of primer, and painting with masonry paint. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of paint color and type). Ensures a strong and appealing concrete finish.",
                  "unit_of_measurement": "sq ft"
                },
                "8.10.4": {
                  "activity": "Concrete Staining",
                  "description": "Staining of concrete surfaces to enhance appearance and provide a natural finish. This service includes surface preparation and application of concrete stain. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Provides a beautiful and long-lasting concrete finish.",
                  "unit_of_measurement": "sq ft"
                }
              }
            }
          }
        }
      },
      {
        "9": {
          "section": "Carpentry",
          "categories": {
            "9.1": {
              "category": "Deck",
              "activities": {
                "9.1.1": {
                  "activity": "Adjustable Helical Post Foundation Installation",
                  "description": "Installation of adjustable helical posts for deck foundation to provide strong and adjustable support. This service includes site preparation, installation of helical posts, and adjustment to the required height. Includes comprehensive labor, rough materials, equipment usage, and helical posts (client's choice of specifications). Ensures a stable and adjustable foundation for deck construction.",
                  "unit_of_measurement": "each"
                },
                "9.1.2": {
                  "activity": "Plastic Adjustable Pedestal and Framing Installation",
                  "description": "Installation of plastic adjustable pedestals and framing for decking. This service includes site preparation, installation of adjustable pedestals, and framing setup. Includes comprehensive labor, rough materials, equipment usage, and pedestals (client's choice of specifications). Provides a flexible and durable decking foundation.",
                  "unit_of_measurement": "sq ft"
                },
                "9.1.3": {
                  "activity": "Concrete Blocks and Lumber Foundation Installation",
                  "description": "Installation of concrete blocks and lumber foundation for decking. This service includes site preparation, placement of concrete blocks, and installation of lumber framing. Includes comprehensive labor, rough materials, equipment usage, and concrete blocks (client's choice of specifications). Ensures a solid and durable foundation for decking.",
                  "unit_of_measurement": "sq ft"
                },
                "9.1.4": {
                  "activity": "Pressure-Treated Wood Decking Installation",
                  "description": "Installation of pressure-treated wood decking for a durable and resistant outdoor deck. This service includes deck design, site preparation, installation of pressure-treated wood planks, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and pressure-treated wood (client's choice of specifications). Ensures a long-lasting and attractive deck.",
                  "unit_of_measurement": "sq ft"
                },
                "9.1.5": {
                  "activity": "Composite Decking Installation",
                  "description": "Installation of composite decking for a low-maintenance and eco-friendly deck. This service includes deck design, site preparation, installation of composite decking boards, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and composite decking (client's choice of specifications). Provides a durable and maintenance-free decking solution.",
                  "unit_of_measurement": "sq ft"
                },
                "9.1.6": {
                  "activity": "Deck Stairs Installation (Up to 4 Feet)",
                  "description": "Installation of deck stairs up to 4 feet in height for safe and convenient access. This service includes design, site preparation, installation of stair stringers, treads, and risers, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and stair components (client's choice of specifications). Ensures safe and sturdy deck stairs.",
                  "unit_of_measurement": "step"
                },
                "9.1.7": {
                  "activity": "Deck Stair Balusters Installation",
                  "description": "Installation of balusters for deck stairs to enhance safety and aesthetics. This service includes site preparation, installation of balusters, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and balusters (client's choice of specifications). Provides an attractive and secure deck stair railing.",
                  "unit_of_measurement": "lin ft"
                },
                "9.1.8": {
                  "activity": "Deck Railing Installation",
                  "description": "Installation of deck railing for enhanced safety and aesthetics. This service includes site preparation, installation of railing posts, rails, and balusters, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and railing components (client's choice of specifications). Ensures a secure and stylish deck railing.",
                  "unit_of_measurement": "lin ft"
                },
                "9.1.9": {
                  "activity": "Glass Railing Installation",
                  "description": "Installation of glass railing for a modern and unobstructed view. This service includes site preparation, installation of glass panels, railing posts, and hardware, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and glass railing components (client's choice of specifications). Provides a sleek and safe deck railing solution.",
                  "unit_of_measurement": "each"
                },
                "9.1.10": {
                  "activity": "Glass Deck Gate Installation",
                  "description": "Installation of a glass deck gate for a modern and secure access point. This service includes site preparation, installation of glass panels, gate hardware, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and glass gate components (client's choice of specifications). Ensures a stylish and secure deck gate.",
                  "unit_of_measurement": "each"
                },
                "9.1.11": {
                  "activity": "Aluminum Deck Gate Installation",
                  "description": "Installation of an aluminum deck gate for a durable and low-maintenance access point. This service includes site preparation, installation of aluminum panels, gate hardware, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and aluminum gate components (client's choice of specifications). Provides a sturdy and maintenance-free deck gate.",
                  "unit_of_measurement": "each"
                },
                "9.1.12": {
                  "activity": "Non-Slip Aluminum Nosing Installation",
                  "description": "Installation of non-slip aluminum nosing on deck stairs for enhanced safety. This service includes site preparation, installation of non-slip nosing, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and non-slip aluminum nosing (client's choice of specifications). Ensures safe and slip-resistant deck stairs.",
                  "unit_of_measurement": "each"
                },
                "9.1.13": {
                  "activity": "Deck Plank Removal",
                  "description": "Removal of existing deck planks for renovation or replacement. This service includes site preparation, removal of old deck planks, and disposal of debris. Includes comprehensive labor, rough materials, and equipment usage. Provides a clear deck surface ready for new installation.",
                  "unit_of_measurement": "sq ft"
                },
                "9.1.14": {
                  "activity": "Deck Sanding, Staining, and Finishing",
                  "description": "Sanding, staining, and finishing of deck surfaces for enhanced appearance and protection. This service includes surface preparation, sanding, application of stain, and finishing coats. Includes comprehensive labor, rough materials, equipment usage, and finishes (client's choice of stain color and type). Ensures a beautiful and well-protected deck surface.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "9.2": {
              "category": "Fence",
              "activities": {
                "9.2.1": {
                  "activity": "Premium Cedar Fence Installation",
                  "description": "Installation of a premium cedar fence for durability and natural beauty. This service includes site preparation, installation of cedar fence panels and posts, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and cedar fence materials (client's choice of specifications). Ensures a high-quality and long-lasting fence.",
                  "unit_of_measurement": "lin ft"
                },
                "9.2.2": {
                  "activity": "Western Red Cedar Fence Installation",
                  "description": "Installation of a Western Red Cedar fence for natural aesthetics and durability. This service includes site preparation, installation of cedar fence panels and posts, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and Western Red Cedar materials (client's choice of specifications). Provides a beautiful and durable fencing solution.",
                  "unit_of_measurement": "lin ft"
                },
                "9.2.3": {
                  "activity": "Picket Fence Installation",
                  "description": "Installation of a picket fence for classic charm and boundary definition. This service includes site preparation, installation of picket fence panels and posts, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and picket fence materials (client's choice of specifications). Ensures an attractive and functional fence.",
                  "unit_of_measurement": "lin ft"
                },
                "9.2.4": {
                  "activity": "Vinyl Fence Installation",
                  "description": "Installation of a vinyl fence for low-maintenance and durable boundary definition. This service includes site preparation, installation of vinyl fence panels and posts, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and vinyl fence materials (client's choice of specifications). Provides a long-lasting and maintenance-free fencing solution.",
                  "unit_of_measurement": "lin ft"
                },
                "9.2.5": {
                  "activity": "Chain Link Fence Installation",
                  "description": "Installation of a chain link fence for security and boundary definition. This service includes site preparation, installation of chain link mesh and posts, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and chain link materials (client's choice of specifications). Ensures a secure and durable fence.",
                  "unit_of_measurement": "lin ft"
                },
                "9.2.6": {
                  "activity": "Metal Fence Installation",
                  "description": "Installation of a metal fence for enhanced security and durability. This service includes site preparation, installation of metal fence panels and posts, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and metal fence materials (client's choice of specifications). Provides a strong and secure fencing solution.",
                  "unit_of_measurement": "lin ft"
                },
                "9.2.7": {
                  "activity": "Composite Fence Installation",
                  "description": "Installation of a composite fence for low-maintenance and eco-friendly boundary definition. This service includes site preparation, installation of composite fence panels and posts, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and composite fence materials (client's choice of specifications). Ensures a durable and environmentally friendly fence.",
                  "unit_of_measurement": "lin ft"
                },
                "9.2.8": {
                  "activity": "Composite Fence on Concrete Installation",
                  "description": "Installation of a composite fence on a concrete base for added stability and durability. This service includes site preparation, installation of concrete base, composite fence panels, and posts, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and composite fence materials (client's choice of specifications). Provides a stable and long-lasting fencing solution.",
                  "unit_of_measurement": "lin ft"
                },
                "9.2.9": {
                  "activity": "Driveway Metal Gate Installation",
                  "description": "Installation of a metal gate for driveway access and security. This service includes site preparation, installation of metal gate and posts, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and metal gate materials (client's choice of specifications). Ensures a secure and functional driveway gate.",
                  "unit_of_measurement": "each"
                },
                "9.2.10": {
                  "activity": "Single Automatic Gate Opener Installation",
                  "description": "Installation of a single automatic gate opener for convenient and secure access. This service includes site preparation, installation of gate opener motor and controls, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and gate opener (client's choice of model and specifications). Provides easy and secure automatic gate operation.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "9.3": {
              "category": "Pergola",
              "activities": {
                "9.3.1": {
                  "activity": "Cedar Pergola Kit Installation",
                  "description": "Installation of a cedar pergola kit for outdoor shading and aesthetics. This service includes site preparation, assembly, and installation of the cedar pergola kit, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and cedar pergola kit (client's choice of specifications). Ensures a beautiful and functional outdoor structure.",
                  "unit_of_measurement": "sq ft"
                },
                "9.3.2": {
                  "activity": "Concrete Column Pergola Installation",
                  "description": "Installation of a pergola with concrete columns for enhanced stability and durability. This service includes site preparation, installation of concrete columns, pergola beams, and roofing, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and pergola materials (client's choice of specifications). Provides a strong and stylish outdoor structure.",
                  "unit_of_measurement": "each"
                },
                "9.3.3": {
                  "activity": "Polycarbonate Roof Installation",
                  "description": "Installation of a polycarbonate roof for a pergola to provide weather protection. This service includes site preparation, installation of polycarbonate panels, and securing the roof structure. Includes comprehensive labor, rough materials, equipment usage, and polycarbonate roofing (client's choice of specifications). Ensures a weather-resistant and durable pergola roof.",
                  "unit_of_measurement": "sq ft"
                },
                "9.3.4": {
                  "activity": "Pergola Removal",
                  "description": "Removal of an existing pergola structure. This service includes site preparation, dismantling of the pergola, and disposal of materials. Includes comprehensive labor, rough materials, and equipment usage. Provides a clear space ready for new installations or landscaping.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "9.4": {
              "category": "Gazebo",
              "activities": {
                "9.4.1": {
                  "activity": "Cedar Gazebo Kit Installation",
                  "description": "Installation of a cedar gazebo kit for outdoor shading and aesthetics. This service includes site preparation, assembly, and installation of the cedar gazebo kit, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and cedar gazebo kit (client's choice of specifications). Ensures a beautiful and functional outdoor structure.",
                  "unit_of_measurement": "sq ft"
                },
                "9.4.2": {
                  "activity": "Concrete Column Gazebo Installation",
                  "description": "Installation of a gazebo with concrete columns for enhanced stability and durability. This service includes site preparation, installation of concrete columns, gazebo beams, and roofing, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and gazebo materials (client's choice of specifications). Provides a strong and stylish outdoor structure.",
                  "unit_of_measurement": "each"
                },
                "9.4.3": {
                  "activity": "Gazebo Roof Installation",
                  "description": "Installation of a roof for a gazebo to provide weather protection. This service includes site preparation, installation of roofing materials, and securing the roof structure. Includes comprehensive labor, rough materials, equipment usage, and roofing materials (client's choice of specifications). Ensures a weather-resistant and durable gazebo roof.",
                  "unit_of_measurement": "sq ft"
                },
                "9.4.4": {
                  "activity": "Gazebo Removal",
                  "description": "Removal of an existing gazebo structure. This service includes site preparation, dismantling of the gazebo, and disposal of materials. Includes comprehensive labor, rough materials, and equipment usage. Provides a clear space ready for new installations or landscaping.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "9.5": {
              "category": "Outdoor Furniture",
              "activities": {
                "9.5.1": {
                  "activity": "Outdoor Furniture Assembly",
                  "description": "Assembly of outdoor furniture for a ready-to-use setup. This service includes unpacking, verifying parts, and assembling outdoor furniture according to manufacturer instructions. Includes comprehensive labor, rough materials, and equipment usage. Ensures properly assembled and functional outdoor furniture.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "9.6": {
              "category": "Storage",
              "activities": {
                "9.6.1": {
                  "activity": "Outdoor Storage Concrete Slab Foundation Installation",
                  "description": "Installation of a concrete slab foundation for outdoor storage buildings. This service includes site preparation, pouring concrete, and finishing the slab. Includes comprehensive labor, rough materials, equipment usage, and concrete materials. Provides a durable and stable foundation.",
                  "unit_of_measurement": "sq ft"
                },
                "9.6.2": {
                  "activity": "Outdoor Storage Square Patio Skge Basement Installation",
                  "description": "Installation of a square patio skge basement for outdoor storage buildings. This service includes site preparation, laying patio skges, and securing the foundation. Includes comprehensive labor, rough materials, equipment usage, and patio skge materials (client's choice of specifications). Provides a stable and attractive foundation.",
                  "unit_of_measurement": "sq ft"
                },
                "9.6.3": {
                  "activity": "Outdoor Storage Shed Installation",
                  "description": "Installation of an outdoor storage shed for additional storage space. This service includes site preparation, assembly, and installation of the shed, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and shed materials (client's choice of specifications). Ensures a functional and durable storage solution.",
                  "unit_of_measurement": "sq ft"
                },
                "9.6.4": {
                  "activity": "Carport Installation",
                  "description": "Installation of a carport for vehicle protection. This service includes site preparation, assembly, and installation of the carport structure, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and carport materials (client's choice of specifications). Provides a durable and protective carport.",
                  "unit_of_measurement": "sq ft"
                },
                "9.6.5": {
                  "activity": "Storage Building Kit Installation",
                  "description": "Installation of a storage building kit for additional storage space. This service includes site preparation, assembly, and installation of the storage building kit, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and storage building kit (client's choice of specifications). Ensures a functional and durable storage solution.",
                  "unit_of_measurement": "sq ft"
                },
                "9.6.6": {
                  "activity": "Patio Cover Installation",
                  "description": "Installation of a patio cover for outdoor shading and protection. This service includes site preparation, assembly, and installation of the patio cover structure, and finishing touches. Includes comprehensive labor, rough materials, equipment usage, and patio cover materials (client's choice of specifications). Provides a stylish and functional patio cover.",
                  "unit_of_measurement": "sq ft"
                },
                "9.6.7": {
                  "activity": "Outdoor Storage Removal",
                  "description": "Removal of an existing outdoor storage structure. This service includes site preparation, dismantling of the storage structure, and disposal of materials. Includes comprehensive labor, rough materials, and equipment usage. Provides a clear space ready for new installations or landscaping.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "9.7": {
              "category": "Playground",
              "activities": {
                "9.7.1": {
                  "activity": "Swing Sets Installation",
                  "description": "Installation of swing sets to create a fun and safe play area for children. This service includes site preparation, assembly, and installation of the swing set, and securing it for safety. Includes comprehensive labor, rough materials, equipment usage, and swing set (client's choice of specifications). Ensures a secure and enjoyable play structure.",
                  "unit_of_measurement": "sq ft"
                },
                "9.7.2": {
                  "activity": "Playhouse Installation",
                  "description": "Installation of a playhouse for an exciting outdoor play experience. This service includes site preparation, assembly, and installation of the playhouse, and securing it for safety. Includes comprehensive labor, rough materials, equipment usage, and playhouse (client's choice of specifications). Provides a safe and engaging play environment.",
                  "unit_of_measurement": "sq ft"
                },
                "9.7.3": {
                  "activity": "Sandbox Installation",
                  "description": "Installation of a sandbox for children's outdoor play. This service includes site preparation, assembly, and installation of the sandbox, and filling it with sand. Includes comprehensive labor, rough materials, equipment usage, and sandbox (client's choice of specifications). Ensures a fun and safe play area.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "9.8": {
              "category": "Staircases",
              "activities": {
                "9.8.1": {
                  "activity": "4-Step Outdoor Stair Installation",
                  "description": "Installation of a 4-step outdoor stair for easy and safe access. This service includes site preparation, assembly, and installation of the stairs, and securing them for stability. Includes comprehensive labor, rough materials, equipment usage, and stair materials (client's choice of specifications). Ensures a stable and secure stairway.",
                  "unit_of_measurement": "each"
                },
                "9.8.2": {
                  "activity": "5-Step Outdoor Stair Installation",
                  "description": "Installation of a 5-step outdoor stair for easy and safe access. This service includes site preparation, assembly, and installation of the stairs, and securing them for stability. Includes comprehensive labor, rough materials, equipment usage, and stair materials (client's choice of specifications). Ensures a stable and secure stairway.",
                  "unit_of_measurement": "each"
                },
                "9.8.3": {
                  "activity": "6-Step Outdoor Stair Installation",
                  "description": "Installation of a 6-step outdoor stair for easy and safe access. This service includes site preparation, assembly, and installation of the stairs, and securing them for stability. Includes comprehensive labor, rough materials, equipment usage, and stair materials (client's choice of specifications). Ensures a stable and secure stairway.",
                  "unit_of_measurement": "each"
                },
                "9.8.4": {
                  "activity": "8-Step Outdoor Stair Installation",
                  "description": "Installation of an 8-step outdoor stair for easy and safe access. This service includes site preparation, assembly, and installation of the stairs, and securing them for stability. Includes comprehensive labor, rough materials, equipment usage, and stair materials (client's choice of specifications). Ensures a stable and secure stairway.",
                  "unit_of_measurement": "each"
                },
                "9.8.5": {
                  "activity": "6-Foot Staircase Landing Installation",
                  "description": "Installation of a 6-foot staircase landing for safe and convenient access. This service includes site preparation, assembly, and installation of the landing, and securing it for stability. Includes comprehensive labor, rough materials, equipment usage, and landing materials (client's choice of specifications). Ensures a stable and secure landing.",
                  "unit_of_measurement": "each"
                },
                "9.8.6": {
                  "activity": "8-Foot Staircase Landing Installation",
                  "description": "Installation of an 8-foot staircase landing for safe and convenient access. This service includes site preparation, assembly, and installation of the landing, and securing it for stability. Includes comprehensive labor, rough materials, equipment usage, and landing materials (client's choice of specifications). Ensures a stable and secure landing.",
                  "unit_of_measurement": "each"
                },
                "9.8.7": {
                  "activity": "Staircase Concrete Foundation Pillar and Columns Installation",
                  "description": "Installation of concrete foundation pillars and columns for outdoor staircases. This service includes site preparation, pouring concrete, and securing the foundation pillars and columns. Includes comprehensive labor, rough materials, equipment usage, and concrete materials (client's choice of specifications). Provides a strong and stable foundation.",
                  "unit_of_measurement": "each"
                },
                "9.8.8": {
                  "activity": "Staircase Adjustable Ground Spike Foundation Installation",
                  "description": "Installation of adjustable ground spike foundations for outdoor staircases. This service includes site preparation, installation of ground spikes, and securing the foundation. Includes comprehensive labor, rough materials, equipment usage, and ground spike materials (client's choice of specifications). Provides a flexible and stable foundation.",
                  "unit_of_measurement": "each"
                },
                "9.8.9": {
                  "activity": "Outdoor Staircase Step Replacement",
                  "description": "Replacement of steps in outdoor staircases to ensure safety and durability. This service includes removal of old steps, installation of new steps, and securing them for stability. Includes comprehensive labor, rough materials, equipment usage, and step materials (client's choice of specifications). Ensures safe and stable stairs.",
                  "unit_of_measurement": "each"
                },
                "9.8.10": {
                  "activity": "Outdoor Staircase Hand Rail Replacement",
                  "description": "Replacement of handrails in outdoor staircases for improved safety and aesthetics. This service includes removal of old handrails, installation of new handrails, and securing them for stability. Includes comprehensive labor, rough materials, equipment usage, and handrail materials (client's choice of specifications). Ensures a safe and stable handrail.",
                  "unit_of_measurement": "each"
                },
                "9.8.11": {
                  "activity": "Outdoor Staircase Removal (Per Rise)",
                  "description": "Removal of outdoor staircase rises for renovation or replacement. This service includes site preparation, dismantling of staircase rises, and disposal of materials. Includes comprehensive labor, rough materials, equipment usage. Provides a clear space ready for new installations or landscaping.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "9.9": {
              "category": "Walkway",
              "activities": {
                "9.9.1": {
                  "activity": "Wooden Walkway Installation",
                  "description": "Installation of a wooden walkway to create a durable and attractive pathway. This service includes site preparation, assembly, and installation of the walkway, and securing it for stability. Includes comprehensive labor, rough materials, equipment usage, and wooden walkway materials (client's choice of specifications). Ensures a sturdy and aesthetically pleasing pathway.",
                  "unit_of_measurement": "sq ft"
                },
                "9.9.2": {
                  "activity": "Wooden Walkway Sanding and Staining",
                  "description": "Sanding and staining of a wooden walkway to enhance its appearance and durability. This service includes site preparation, sanding, application of stain, and sealing for protection. Includes comprehensive labor, rough materials, equipment usage, and stain (client's choice of color and finish). Ensures a refreshed and protected wooden walkway.",
                  "unit_of_measurement": "sq ft"
                },
                "9.9.3": {
                  "activity": "Wooden Walkway Removal",
                  "description": "Removal of an existing wooden walkway for renovation or landscaping. This service includes site preparation, dismantling of the walkway, and disposal of materials. Includes comprehensive labor, rough materials, equipment usage. Provides a clear space ready for new installations or landscaping.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "9.10": {
              "category": "Dock",
              "activities": {
                "9.10.1": {
                  "activity": "Boat Dock Installation",
                  "description": "Installation of a boat dock to provide convenient and secure docking for boats. This service includes site preparation, assembly, and installation of the dock, and securing it for stability. Includes comprehensive labor, rough materials, equipment usage, and boat dock materials (client's choice of specifications). Ensures a stable and functional boat dock.",
                  "unit_of_measurement": "sq ft"
                },
                "9.10.2": {
                  "activity": "Cedar Dock Decking Installation for Boat Dock Systems",
                  "description": "Installation of cedar dock decking for boat dock systems to create a durable and attractive surface. This service includes preparation, assembly, and installation of the decking, and securing it for stability. Includes comprehensive labor, rough materials, equipment usage, and cedar decking (client's choice of specifications). Ensures a sturdy and aesthetically pleasing dock surface.",
                  "unit_of_measurement": "sq ft"
                },
                "9.10.3": {
                  "activity": "Gangway Installation",
                  "description": "Installation of a gangway for safe and convenient access to docks. This service includes site preparation, assembly, and installation of the gangway, and securing it for stability. Includes comprehensive labor, rough materials, equipment usage, and gangway materials (client's choice of specifications). Ensures a stable and functional access way.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "9.11": {
              "category": "Floating dock",
              "activities": {
                "9.11.1": {
                  "activity": "10 ft. x 10 ft. Medium Freeboard Floating Dock Installation",
                  "description": "Installation of a 10 ft. x 10 ft. medium freeboard floating dock for versatile water access. This service includes site preparation, assembly, and installation of the floating dock, and securing it for stability. Includes comprehensive labor, rough materials, equipment usage, and floating dock materials (client's choice of specifications). Ensures a stable and functional floating dock.",
                  "unit_of_measurement": "each"
                },
                "9.11.2": {
                  "activity": "4 ft. x 10 ft. Commercial Grade Floating Dock Installation",
                  "description": "Installation of a 4 ft. x 10 ft. commercial grade floating dock for durable water access. This service includes site preparation, assembly, and installation of the floating dock, and securing it for stability. Includes comprehensive labor, rough materials, equipment usage, and floating dock materials (client's choice of specifications). Ensures a durable and stable floating dock.",
                  "unit_of_measurement": "each"
                },
                "9.11.3": {
                  "activity": "8 ft. x 10 ft. Aluminum Floating Swim Raft with Resin Top and Resin Dock Ladder Installation",
                  "description": "Installation of an 8 ft. x 10 ft. aluminum floating swim raft with resin top and resin dock for recreational water access. This service includes site preparation, assembly, and installation of the swim raft and dock, and securing them for stability. Includes comprehensive labor, rough materials, equipment usage, and swim raft and dock materials (client's choice of specifications). Ensures a stable and enjoyable recreational platform.",
                  "unit_of_measurement": "each"
                },
                "9.11.4": {
                  "activity": "4 ft. x 10 ft. Aluminum Floating Dock with Resin Top Installation",
                  "description": "Installation of a 4 ft. x 10 ft. aluminum floating dock with resin top for durable water access. This service includes site preparation, assembly, and installation of the floating dock, and securing it for stability. Includes comprehensive labor, rough materials, equipment usage, and floating dock materials (client's choice of specifications). Ensures a durable and stable floating dock.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "9.12": {
              "category": "Maintenance",
              "activities": {
                "9.12.1": {
                  "activity": "Outdoor Carpentry Inspection and Assessment",
                  "description": "Comprehensive inspection and assessment of outdoor carpentry structures to evaluate their condition and identify necessary maintenance or repairs. This service includes visual inspection, detailed assessment, and reporting on findings. Includes comprehensive labor and equipment usage. Ensures well-maintained and safe outdoor structures.",
                  "unit_of_measurement": "each"
                },
                "9.12.2": {
                  "activity": "Outdoor Carpentry Pest Prevention",
                  "description": "Implementation of pest prevention measures for outdoor carpentry structures to protect them from damage. This service includes inspection, application of pest deterrents, and installation of physical barriers if needed. Includes comprehensive labor, rough materials, equipment usage, and pest prevention materials. Ensures protection from pests and prolongs the lifespan of outdoor carpentry.",
                  "unit_of_measurement": "sq ft"
                },
                "9.12.3": {
                  "activity": "Outdoor Carpentry Refinishing",
                  "description": "Refinishing of outdoor carpentry structures to restore their appearance and durability. This service includes cleaning, sanding, staining, and sealing. Includes comprehensive labor, rough materials, equipment usage, and finishing materials (client's choice of color and finish). Ensures a refreshed and well-protected outdoor carpentry structure.",
                  "unit_of_measurement": "sq ft"
                },
                "9.12.4": {
                  "activity": "Outdoor Carpentry Winter Prep",
                  "description": "Preparation of outdoor carpentry structures for winter to protect them from harsh weather conditions. This service includes inspection, application of protective coatings, and necessary repairs. Includes comprehensive labor, rough materials, equipment usage, and winter preparation materials. Ensures protection and longevity of outdoor carpentry during winter.",
                  "unit_of_measurement": "sq ft"
                },
                "9.12.5": {
                  "activity": "Outdoor Carpentry Summer Prep",
                  "description": "Preparation of outdoor carpentry structures for summer to ensure they are in optimal condition for use. This service includes inspection, cleaning, and necessary repairs. Includes comprehensive labor, rough materials, equipment usage, and summer preparation materials. Ensures readiness and enjoyment of outdoor carpentry during summer.",
                  "unit_of_measurement": "sq ft"
                }
              }
            }
          }
        }
      },
      {
        "10": {
          "section": "Electrical",
          "categories": {
            "10.1": {
              "category": "Electrical Panel",
              "activities": {
                "10.1.1": {
                  "activity": "Outdoor Electrical Panel Installation",
                  "description": "Installation of an outdoor electrical panel to manage electrical circuits and provide safe power distribution. This service includes mounting the panel, connecting it to the main power supply, and ensuring proper operation. Includes comprehensive labor, rough materials, equipment usage, and outdoor electrical panel (client's choice of model and specifications). Ensures a safe and efficient electrical system.",
                  "unit_of_measurement": "each"
                },
                "10.1.2": {
                  "activity": "Circuit Breaker Replacement",
                  "description": "Replacement of circuit breakers to maintain electrical safety and functionality. This service includes identifying the faulty breaker, replacing it with a new one, and testing the electrical system. Includes comprehensive labor, rough materials, and equipment usage. Ensures reliable protection against electrical faults.",
                  "unit_of_measurement": "each"
                },
                "10.1.3": {
                  "activity": "Outdoor Electrical Panel Cleaning and Lubricating",
                  "description": "Cleaning and lubricating an outdoor electrical panel to ensure optimal performance and longevity. This service includes opening the panel, cleaning internal components, and applying lubricants as needed. Includes comprehensive labor, rough materials, and equipment usage. Ensures a well-maintained and efficient electrical panel.",
                  "unit_of_measurement": "each"
                },
                "10.1.4": {
                  "activity": "Outdoor Electrical Panel Emergency Repairs",
                  "description": "Emergency repairs of an outdoor electrical panel to restore electrical service quickly and safely. This service includes diagnosing the issue, performing necessary repairs, and testing the system. Includes comprehensive labor, rough materials, and equipment usage. Ensures rapid and reliable restoration of electrical service.",
                  "unit_of_measurement": "each"
                },
                "10.1.5": {
                  "activity": "Outdoor Electrical Panel Safety Inspection",
                  "description": "Safety inspection of an outdoor electrical panel to identify potential hazards and ensure compliance with electrical codes. This service includes a thorough examination of the panel, connections, and components. Includes comprehensive labor, rough materials, and equipment usage. Ensures a safe and code-compliant electrical panel.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "10.2": {
              "category": "Outlet and Switch",
              "activities": {
                "10.2.1": {
                  "activity": "Backyard Outlet Installation",
                  "description": "Installation of an electrical outlet in the backyard for convenient access to power. This service includes site preparation, wiring, mounting the outlet, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and outdoor outlet (client's choice of model and specifications). Ensures reliable outdoor power access.",
                  "unit_of_measurement": "each"
                },
                "10.2.2": {
                  "activity": "Weatherproof Outlet Installation",
                  "description": "Installation of a weatherproof electrical outlet to provide safe and durable outdoor power access. This service includes site preparation, wiring, mounting the outlet, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and weatherproof outlet (client's choice of model and specifications). Ensures a protected and reliable outdoor power source.",
                  "unit_of_measurement": "each"
                },
                "10.2.3": {
                  "activity": "Backyard Outlet with Switch Installation",
                  "description": "Installation of an electrical outlet with a switch in the backyard for controlled power access. This service includes site preparation, wiring, mounting the outlet and switch, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and outlet with switch (client's choice of model and specifications). Ensures convenient and controlled outdoor power access.",
                  "unit_of_measurement": "each"
                },
                "10.2.4": {
                  "activity": "Power Pedestal for RV Installation",
                  "description": "Installation of a power pedestal for RVs to provide reliable electrical hookups. This service includes site preparation, wiring, mounting the power pedestal, and testing for proper operation. Includes comprehensive labor, equipment usage, and power pedestal (client's choice of model and specifications). Ensures a safe and reliable power source for RVs.",
                  "unit_of_measurement": "each"
                },
                "10.2.5": {
                  "activity": "Running Power Cable for Installing a Power Pedestal",
                  "description": "Running power cable for the installation of a power pedestal to ensure proper electrical connections. This service includes site preparation, trenching if necessary, laying the cable, and connecting it to the power source. Includes comprehensive labor, rough materials, and equipment usage. Ensures a reliable power supply for the power pedestal.",
                  "unit_of_measurement": "lin ft"
                }
              }
            },
            "10.3": {
              "category": "EV Chargers",
              "activities": {
                "10.3.1": {
                  "activity": "EV Charger Installation",
                  "description": "Installation of an EV charger to provide convenient home charging for electric vehicles. This service includes site preparation, wiring, mounting the charger, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and EV charger (client's choice of model and specifications). Ensures a safe and efficient charging solution.",
                  "unit_of_measurement": "each"
                },
                "10.3.2": {
                  "activity": "Running Power Cable for Installing an EV Charger",
                  "description": "Running power cable for the installation of an EV charger to ensure proper electrical connections. This service includes site preparation, trenching if necessary, laying the cable, and connecting it to the power source. Includes comprehensive labor, rough materials, and equipment usage. Ensures a reliable power supply for the EV charger.",
                  "unit_of_measurement": "lin ft"
                }
              }
            },
            "10.4": {
              "category": "Pool and Spa",
              "activities": {
                "10.4.1": {
                  "activity": "Pool Heater Installation",
                  "description": "Installation of a pool heater to maintain a comfortable swimming temperature. This service includes mounting the heater, connecting it to the pool's plumbing and electrical systems, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and pool heater (client's choice of model and specifications). Ensures efficient pool heating for extended swimming seasons.",
                  "unit_of_measurement": "each"
                },
                "10.4.2": {
                  "activity": "Pool Pump Motor Replacement",
                  "description": "Replacement of a pool pump motor to ensure proper water circulation and filtration. This service includes removing the old motor, installing the new one, and testing for proper operation. Includes comprehensive labor, materials, and equipment usage. Ensures a reliable and efficient pool pump system.",
                  "unit_of_measurement": "each"
                },
                "10.4.3": {
                  "activity": "Sauna Heater Installation",
                  "description": "Installation of a sauna heater to provide consistent and controllable heat for the sauna. This service includes mounting the heater, connecting it to the electrical system, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and sauna heater (client's choice of model and specifications). Ensures a warm and relaxing sauna experience.",
                  "unit_of_measurement": "each"
                },
                "10.4.4": {
                  "activity": "Hot Tub Pump Installation",
                  "description": "Installation of a hot tub pump to ensure proper water circulation and jet operation. This service includes mounting the pump, connecting it to the hot tub's plumbing and electrical systems, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and hot tub pump (client's choice of model and specifications). Ensures efficient hot tub performance.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "10.5": {
              "category": "Ceiling Fans",
              "activities": {
                "10.5.1": {
                  "activity": "Wet Rated Outdoor Ceiling Fan Installation",
                  "description": "Installation of a wet-rated outdoor ceiling fan to provide cooling and air circulation in outdoor areas. This service includes mounting the fan, connecting it to the electrical system, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and outdoor ceiling fan (client's choice of model and specifications). Ensures reliable and efficient outdoor cooling.",
                  "unit_of_measurement": "each"
                },
                "10.5.2": {
                  "activity": "Mounting Bracket and Canopy Replacement",
                  "description": "Replacement of the mounting bracket and canopy for ceiling fans to ensure secure installation and proper operation. This service includes removing the old components, installing the new ones, and ensuring proper alignment and functionality. Includes comprehensive labor, rough materials, and equipment usage. Ensures a stable and properly functioning ceiling fan.",
                  "unit_of_measurement": "each"
                },
                "10.5.3": {
                  "activity": "Attach and Rebalance Blades",
                  "description": "Attaching and rebalancing blades for ceiling fans to improve performance and reduce wobbling. This service includes securely attaching the blades, balancing them, and testing for smooth operation. Includes comprehensive labor, rough materials, and equipment usage. Ensures a well-balanced and efficient ceiling fan.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "10.6": {
              "category": "Audio-Visual",
              "activities": {
                "10.6.1": {
                  "activity": "Outdoor Home Theater Installation",
                  "description": "Installation of an outdoor home theater system to provide high-quality entertainment in outdoor spaces. This service includes mounting the screen, setting up the audio system, and connecting all components. Includes comprehensive labor, rough materials, equipment usage, and outdoor home theater system (client's choice of model and specifications). Ensures an immersive outdoor entertainment experience.",
                  "unit_of_measurement": "each"
                },
                "10.6.2": {
                  "activity": "Rock Speakers Installation",
                  "description": "Installation of rock speakers to provide discreet and high-quality outdoor audio. This service includes placing the speakers in the desired locations, connecting them to the audio system, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and rock speakers (client's choice of model and specifications). Ensures high-quality outdoor sound.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "10.7": {
              "category": "Backup Power",
              "activities": {
                "10.7.1": {
                  "activity": "Whole House Propane/Natural Gas Generator Installation",
                  "description": "Installation of a whole house propane or natural gas generator to provide backup power during outages. This service includes mounting the generator, connecting it to the home's electrical and fuel systems, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and generator (client's choice of model and specifications). Ensures reliable backup power.",
                  "unit_of_measurement": "each"
                },
                "10.7.2": {
                  "activity": "Whole House Generator Maintenance",
                  "description": "Maintenance of a whole house generator to ensure reliable operation. This service includes inspecting the generator, performing routine maintenance tasks, and testing for proper operation. Includes comprehensive labor, rough materials, and equipment usage. Ensures the generator is ready to provide backup power when needed.",
                  "unit_of_measurement": "each"
                },
                "10.7.3": {
                  "activity": "Battery Terminal Installation",
                  "description": "Installation of battery terminals for backup power systems to ensure secure and efficient connections. This service includes preparing the battery terminals, connecting them to the power system, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage and battery terminal (client's choice of model and specifications). Ensures reliable connections for backup power systems.",
                  "unit_of_measurement": "each"
                },
                "10.7.4": {
                  "activity": "Wind Turbine Installation",
                  "description": "Installation of a wind turbine to generate renewable energy for the home. This service includes mounting the turbine, connecting it to the electrical system, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and wind turbine (client's choice of model and specifications). Ensures efficient wind energy generation.",
                  "unit_of_measurement": "each"
                },
                "10.7.5": {
                  "activity": "Wind Turbine Foundation Installation",
                  "description": "Installation of a foundation for a wind turbine to ensure stability and proper operation. This service includes site preparation, laying the foundation, and securing the turbine. Includes comprehensive labor, rough materials, and equipment usage. Ensures a stable and durable foundation for the wind turbine.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "10.8": {
              "category": "Safety Inspections",
              "activities": {
                "10.8.1": {
                  "activity": "Comprehensive System Evaluation",
                  "description": "Conduct a thorough evaluation of the entire outdoor electrical system to ensure safety and compliance with regulations. This service includes inspecting wiring, connections, and components for potential hazards. Includes comprehensive labor, rough materials, and equipment usage. Ensures a safe and reliable outdoor electrical system.",
                  "unit_of_measurement": "each"
                },
                "10.8.2": {
                  "activity": "Electrical Panel and Circuit Breakers Inspection",
                  "description": "Inspection of the electrical panel and circuit breakers to ensure proper operation and safety. This service includes checking for signs of wear, overheating, and proper function of all breakers. Includes comprehensive labor, rough materials, and equipment usage. Ensures the electrical panel is functioning safely and efficiently.",
                  "unit_of_measurement": "each"
                },
                "10.8.3": {
                  "activity": "Outdoor Electrical Seasonal Preparation",
                  "description": "Prepare the outdoor electrical system for seasonal changes to ensure optimal performance and safety. This service includes inspecting and adjusting components to handle weather variations. Includes comprehensive labor, rough materials, and equipment usage. Ensures the electrical system is ready for seasonal demands.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "10.9": {
              "category": "Solar Panels",
              "activities": {
                "10.9.1": {
                  "activity": "Off Grid Solar 2 kW System Installation",
                  "description": "Installation of an off-grid solar system to provide renewable energy for outdoor areas. This service includes mounting solar panels, connecting them to the battery storage system, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and solar panels (client's choice of model and specifications). Ensures reliable off-grid power generation.",
                  "unit_of_measurement": "each"
                },
                "10.9.2": {
                  "activity": "Monocrystalline Solar Panels Installation",
                  "description": "Installation of monocrystalline solar panels to generate renewable energy. This service includes mounting the panels, connecting them to the electrical system, and testing for proper operation. Includes comprehensive labor, rough materials, equipment usage, and solar panels (client's choice of model and specifications). Ensures efficient and reliable solar power generation.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "10.10": {
              "category": "Maintenance",
              "activities": {
                "10.10.1": {
                  "activity": "Outdoor Electrical Regular Inspections",
                  "description": "Perform regular inspections of the outdoor electrical system to ensure ongoing safety and performance. This service includes checking all components, identifying potential issues, and recommending necessary repairs. Includes comprehensive labor, rough materials, and equipment usage. Ensures the electrical system remains in good condition.",
                  "unit_of_measurement": "each"
                },
                "10.10.2": {
                  "activity": "Outdoor Electrical Troubleshooting and Emergency Repair",
                  "description": "Provide troubleshooting and emergency repair services for outdoor electrical issues. This service includes diagnosing problems, performing necessary repairs, and ensuring the system is safe and functional. Includes comprehensive labor, rough materials, and equipment usage. Ensures prompt resolution of electrical issues.",
                  "unit_of_measurement": "each"
                },
                "10.10.3": {
                  "activity": "Outdoor Electrical Wiring Maintenance",
                  "description": "Maintenance of outdoor electrical wiring to prevent issues and ensure safety. This service includes inspecting, repairing, or replacing wiring as needed. Includes comprehensive labor, rough materials, and equipment usage. Ensures reliable and safe electrical wiring.",
                  "unit_of_measurement": "each"
                }
              }
            }
          }
        }
      },
      {
        "11": {
          "section": "Cleaning",
          "categories": {
            "11.1": {
              "category": "Deck and Patio",
              "activities": {
                "11.1.1": {
                  "activity": "Deck and Patio Pressure Washing",
                  "description": "Pressure washing of decks and patios to remove dirt, mold, and mildew. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and refreshed outdoor surface.",
                  "unit_of_measurement": "sq ft"
                },
                "11.1.2": {
                  "activity": "Deck and Patio Soft Washing",
                  "description": "Soft washing of decks and patios using low-pressure cleaning solutions to remove dirt and stains without damaging surfaces. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a gentle yet effective clean.",
                  "unit_of_measurement": "sq ft"
                },
                "11.1.3": {
                  "activity": "Deck and Patio Deep Cleaning Solutions",
                  "description": "Application of deep cleaning solutions to decks and patios to remove stubborn stains and grime. This service includes comprehensive labor, rough materials, and equipment usage. Ensures thorough cleaning of outdoor areas.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "11.2": {
              "category": "Driveway",
              "activities": {
                "11.2.1": {
                  "activity": "Driveway Pressure Washing",
                  "description": "Pressure washing of driveways to remove dirt, oil stains, and grime. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and safe driveway surface.",
                  "unit_of_measurement": "sq ft"
                },
                "11.2.2": {
                  "activity": "Driveway Soft Washing",
                  "description": "Soft washing of driveways using eco-friendly cleaning solutions to remove dirt and stains without damaging the surface. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and well-maintained driveway.",
                  "unit_of_measurement": "sq ft"
                },
                "11.2.3": {
                  "activity": "Driveway Deep Cleaning Solutions",
                  "description": "Application of deep cleaning solutions to driveways to tackle tough stains and buildup. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a thoroughly clean driveway.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "11.3": {
              "category": "Hot Tub",
              "activities": {
                "11.3.1": {
                  "activity": "Hot Tub Regular Cleaning",
                  "description": "Regular cleaning of hot tubs to maintain hygiene and water quality. This service includes scrubbing, vacuuming, and rinsing the hot tub surfaces. Includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and sanitary hot tub.",
                  "unit_of_measurement": "each"
                },
                "11.3.2": {
                  "activity": "Hot Tub Water Treatment and Cleaning",
                  "description": "Water treatment and cleaning of hot tubs to ensure balanced and safe water quality. This service includes chemical balancing, filter cleaning, and water testing. Includes comprehensive labor, rough materials, and equipment usage. Ensures safe and clear hot tub water.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "11.4": {
              "category": "House Washing",
              "activities": {
                "11.4.1": {
                  "activity": "Vinyl Siding Cleaning",
                  "description": "Cleaning of vinyl siding to remove dirt, mildew, and algae. This service includes washing and scrubbing of the siding surfaces. Includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and bright exterior.",
                  "unit_of_measurement": "sq ft"
                },
                "11.4.2": {
                  "activity": "Wood Siding Cleaning",
                  "description": "Cleaning of wood siding to remove dirt, mold, and mildew while preserving the wood's finish. This service includes gentle washing and scrubbing. Includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and well-maintained wood exterior.",
                  "unit_of_measurement": "sq ft"
                },
                "11.4.3": {
                  "activity": "Brick and Stone Cleaning",
                  "description": "Cleaning of brick and stone surfaces to remove dirt, moss, and stains. This service includes pressure washing and scrubbing of the surfaces. Includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and revitalized brick or stone exterior.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "11.5": {
              "category": "Fence",
              "activities": {
                "11.5.1": {
                  "activity": "Fence Pressure Washing",
                  "description": "Pressure washing of fences to remove dirt, mold, and mildew. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and refreshed fence surface.",
                  "unit_of_measurement": "sq ft"
                },
                "11.5.2": {
                  "activity": "Fence Soft Washing",
                  "description": "Soft washing of fences using low-pressure cleaning solutions to remove dirt and stains without damaging surfaces. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a gentle yet effective clean.",
                  "unit_of_measurement": "sq ft"
                },
                "11.5.3": {
                  "activity": "Fence Stain and Spot Removal",
                  "description": "Removal of stains and spots from fences using specialized cleaning solutions. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and spot-free fence.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "11.6": {
              "category": "Gutter",
              "activities": {
                "11.6.1": {
                  "activity": "Gutter Debris Removal and Pressure Washing",
                  "description": "Removal of debris from gutters followed by pressure washing to ensure clear and functional gutters. This service includes comprehensive labor, rough materials, and equipment usage. Ensures efficient water drainage and prevents gutter blockages.",
                  "unit_of_measurement": "lin ft"
                },
                "11.6.2": {
                  "activity": "Gutter Cleaning Using Scaffold",
                  "description": "Safe and thorough cleaning of gutters using a scaffold to reach high and difficult areas. This service includes comprehensive labor, rough materials, and equipment usage. Ensures clean and debris-free gutters.",
                  "unit_of_measurement": "lin ft"
                }
              }
            },
            "11.7": {
              "category": "Roof",
              "activities": {
                "11.7.1": {
                  "activity": "Roof Soft Washing",
                  "description": "Gentle soft washing of roofs to remove dirt, algae, and moss without damaging roofing materials. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and well-maintained roof.",
                  "unit_of_measurement": "sq ft"
                },
                "11.7.2": {
                  "activity": "Roof, Gutter and Solar Panel Cleaning Combo",
                  "description": "Combined cleaning service for roofs, gutters, and solar panels to enhance efficiency and appearance. This service includes comprehensive labor, rough materials, and equipment usage. Ensures clean and efficient solar panels, gutters, and roof.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "11.8": {
              "category": "Exterior Fixture",
              "activities": {
                "11.8.1": {
                  "activity": "Outdoor Furniture Manual Cleaning",
                  "description": "Manual cleaning of outdoor furniture to remove dirt, grime, and stains. This service includes comprehensive labor, rough materials, and equipment usage. Ensures clean and well-maintained outdoor furniture.",
                  "unit_of_measurement": "each"
                },
                "11.8.2": {
                  "activity": "Exterior Lighting Fixture Cleaning",
                  "description": "Cleaning of exterior lighting fixtures to remove dust, cobwebs, and dirt. This service includes comprehensive labor, rough materials, and equipment usage. Ensures bright and clean lighting fixtures.",
                  "unit_of_measurement": "each"
                },
                "11.8.3": {
                  "activity": "Exterior Decorative Element Cleaning",
                  "description": "Cleaning of exterior decorative elements to restore their appearance and remove accumulated dirt. This service includes comprehensive labor, rough materials, and equipment usage. Ensures clean and attractive exterior decorations.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "11.9": {
              "category": "Pool",
              "activities": {
                "11.9.1": {
                  "activity": "Regular Outdoor Pool Cleaning",
                  "description": "Routine cleaning of outdoor pools to maintain water clarity and hygiene. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a clean and safe swimming environment.",
                  "unit_of_measurement": "sq ft"
                },
                "11.9.2": {
                  "activity": "Pool Shock Treatment",
                  "description": "Shock treatment of pool water to eliminate bacteria, algae, and contaminants. This service includes comprehensive labor, rough materials, and equipment usage. Ensures a healthy and balanced pool water.",
                  "unit_of_measurement": "sq ft"
                },
                "11.9.3": {
                  "activity": "Pool Filter and Equipment Maintenance",
                  "description": "Maintenance of pool filters and equipment to ensure optimal performance and longevity. This service includes comprehensive labor, rough materials, and equipment usage. Ensures efficient pool operation and clean water.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "11.10": {
              "category": "Doors and Window",
              "activities": {
                "11.10.1": {
                  "activity": "Outdoor Glass Cleaning",
                  "description": "Cleaning of outdoor glass surfaces to remove dirt, smudges, and streaks. This service includes comprehensive labor, rough materials, and equipment usage. Ensures clear and sparkling glass.",
                  "unit_of_measurement": "each"
                },
                "11.10.2": {
                  "activity": "Glass Cleaning on a Single Story",
                  "description": "Comprehensive cleaning of floor-to-ceiling glass on single-storey buildings. This service includes comprehensive labor, rough materials, and equipment usage. Ensures spotless and clear glass surfaces.",
                  "unit_of_measurement": "each"
                },
                "11.10.3": {
                  "activity": "Floor-to-Ceiling Glass Cleaning on a 2-4 Storey Building",
                  "description": "Comprehensive cleaning of floor-to-ceiling glass on buildings with 2 to 4 storeys. This service includes comprehensive labor, rough materials, and equipment usage. Ensures spotless and clear glass surfaces.",
                  "unit_of_measurement": "each"
                },
                "11.10.4": {
                  "activity": "Outdoor High-Rise Window Cleaning",
                  "description": "Professional cleaning of high-rise windows to remove dirt and grime. This service includes comprehensive labor, rough materials, and equipment usage. Ensures clean and clear windows at high elevations.",
                  "unit_of_measurement": "day"
                },
                "11.10.5": {
                  "activity": "Garage Door Cleaning",
                  "description": "Cleaning of garage doors to remove dirt, dust, and stains. This service includes comprehensive labor, rough materials, and equipment usage. Ensures clean and well-maintained garage doors.",
                  "unit_of_measurement": "each"
                }
              }
            }
          }
        }
      },
      {
        "18": {
          "section": "Lighting",
          "categories": {
            "18.1": {
              "category": "Path Lights",
              "activities": {
                "18.1.1": {
                  "activity": "Landscape Path Light Kit (6-10 lights) Installation",
                  "description": "Installation of a landscape path light kit, including 6-10 lights, to illuminate garden paths and walkways. This service includes placement, wiring, and connection to power. Includes comprehensive labor, rough materials, and path light kit (client's choice of model and specifications). Ensures well-lit and safe pathways.",
                  "unit_of_measurement": "each"
                },
                "18.1.2": {
                  "activity": "Solar LED In-Ground Path Light Installation",
                  "description": "Installation of solar LED in-ground path lights to provide energy-efficient lighting for walkways. This service includes placement and secure installation in the ground. Includes comprehensive labor, rough materials, and solar path lights (client's choice of model and specifications). Ensures eco-friendly and reliable path lighting.",
                  "unit_of_measurement": "each"
                },
                "18.1.3": {
                  "activity": "Deck Post Lighting Installation",
                  "description": "Installation of deck post lighting to enhance visibility and aesthetics. This service includes mounting lights on deck posts and connecting to power. Includes comprehensive labor, rough materials, and deck post lights (client's choice of model and specifications). Ensures attractive and functional deck lighting.",
                  "unit_of_measurement": "lin ft"
                },
                "18.1.4": {
                  "activity": "Hardwired Path Light Installation",
                  "description": "Installation of hardwired path lights to provide consistent illumination along pathways. This service includes wiring and secure installation. Includes comprehensive labor, rough materials, and hardwired path lights (client's choice of model and specifications). Ensures stable and continuous path lighting.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "18.2": {
              "category": "Deck and Patio",
              "activities": {
                "18.2.1": {
                  "activity": "String Light Kit Installation",
                  "description": "Installation of a string light kit to create an inviting ambiance on decks and patios. This service includes hanging and securing the string lights. Includes comprehensive labor, rough materials, and string light kit (client's choice of model and specifications). Ensures decorative and functional lighting.",
                  "unit_of_measurement": "each"
                },
                "18.2.2": {
                  "activity": "Deck/Step Light Installation",
                  "description": "Installation of deck or step lights to improve safety and visibility. This service includes mounting and wiring lights on deck steps. Includes comprehensive labor, rough materials, and deck/step lights (client's choice of model and specifications). Ensures safe and illuminated steps.",
                  "unit_of_measurement": "each"
                },
                "18.2.3": {
                  "activity": "Deck Post Light Installation",
                  "description": "Installation of lights on deck posts to enhance lighting and aesthetics. This service includes mounting and wiring the lights. Includes comprehensive labor, rough materials, and deck post lights (client's choice of model and specifications). Ensures attractive and effective deck lighting.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "18.3": {
              "category": "Wall Lights",
              "activities": {
                "18.3.1": {
                  "activity": "Single-Story Wall Light Installation",
                  "description": "Installation of wall lights on single-story buildings to provide exterior illumination. This service includes mounting and wiring the lights. Includes comprehensive labor, rough materials, and wall lights (client's choice of model and specifications). Ensures well-lit exterior walls.",
                  "unit_of_measurement": "each"
                },
                "18.3.2": {
                  "activity": "2-3 Story Wall Light Installation",
                  "description": "Installation of wall lights on 2-3 story buildings to enhance exterior lighting. This service includes mounting and wiring the lights at higher elevations. Includes comprehensive labor, rough materials, and wall lights (client's choice of model and specifications). Ensures effective lighting for multi-story buildings.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "18.4": {
              "category": "Security Lighting",
              "activities": {
                "18.4.1": {
                  "activity": "Wall Pack Lights Installation",
                  "description": "Installation of wall pack lights to improve security and visibility around the property. This service includes mounting and wiring the lights. Includes comprehensive labor, rough materials, and wall pack lights (client's choice of model and specifications). Ensures enhanced security lighting.",
                  "unit_of_measurement": "each"
                },
                "18.4.2": {
                  "activity": "Area Lights Installation",
                  "description": "Installation of area lights to provide broad illumination for large outdoor spaces. This service includes placement, wiring, and connection to power. Includes comprehensive labor, rough materials, and area lights (client's choice of model and specifications). Ensures well-lit and secure outdoor areas.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "18.5": {
              "category": "Pool Lighting",
              "activities": {
                "18.5.1": {
                  "activity": "Underwater Light Installation",
                  "description": "Installation of underwater lights to illuminate swimming pools. This service includes placement and secure installation underwater. Includes comprehensive labor, rough materials, and underwater lights (client's choice of model and specifications). Ensures safe and attractive pool lighting.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "18.6": {
              "category": "Smart Lighting",
              "activities": {
                "18.6.1": {
                  "activity": "Smart Outdoor Lighting System Installation (7 lights)",
                  "description": "Installation of a smart outdoor lighting system with 7 lights to provide customizable and efficient lighting. This service includes placement, wiring, and connection to the control system. Includes comprehensive labor, rough materials, and smart lighting system (client's choice of model and specifications). Ensures modern and convenient outdoor lighting.",
                  "unit_of_measurement": "each"
                },
                "18.6.2": {
                  "activity": "Smart Outdoor Lighting System Installation (15 lights)",
                  "description": "Installation of a smart outdoor lighting system with 15 lights to provide extensive and customizable lighting. This service includes placement, wiring, and connection to the control system. Includes comprehensive labor, rough materials, and smart lighting system (client's choice of model and specifications). Ensures comprehensive and intelligent lighting coverage.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "18.7": {
              "category": "Christmas Lights",
              "activities": {
                "18.7.1": {
                  "activity": "Roofline and Eaves Installation on a One-Story Building",
                  "description": "Installation of Christmas lights along the roofline and eaves of a one-story building. This service includes hanging and securing lights for festive decoration. Includes comprehensive labor and rough materials. Ensures beautiful and safe holiday lighting.",
                  "unit_of_measurement": "set"
                },
                "18.7.2": {
                  "activity": "Roofline and Eaves Installation on a 2-3 Story Building",
                  "description": "Installation of Christmas lights along the roofline and eaves of a 2-3 story building. This service includes hanging and securing lights for festive decoration. Includes comprehensive labor and rough materials. Ensures beautiful and safe holiday lighting.",
                  "unit_of_measurement": "lin ft"
                },
                "18.7.3": {
                  "activity": "Medium Tree and Shrub Wrapping",
                  "description": "Wrapping Christmas lights around medium-sized trees and shrubs to create a festive atmosphere. This service includes wrapping and securing lights. Includes comprehensive labor and rough materials. Ensures well-decorated and illuminated trees and shrubs.",
                  "unit_of_measurement": "each"
                },
                "18.7.4": {
                  "activity": "Large Tree and Shrub Wrapping",
                  "description": "Wrapping Christmas lights around large trees and shrubs to create a festive atmosphere. This service includes wrapping and securing lights. Includes comprehensive labor and rough materials. Ensures well-decorated and illuminated trees and shrubs.",
                  "unit_of_measurement": "each"
                },
                "18.7.5": {
                  "activity": "Christmas Light Installation from Customer Materials (Labor)",
                  "description": "Installation of Christmas lights using materials provided by the customer. This service includes hanging and securing lights. Includes comprehensive labor only. Ensures safe and professional holiday lighting.",
                  "unit_of_measurement": "day"
                },
                "18.7.6": {
                  "activity": "Christmas Lights Removal",
                  "description": "Removal of Christmas lights after the holiday season. This service includes taking down and packing lights for storage. Includes comprehensive labor. Ensures a hassle-free post-holiday cleanup.",
                  "unit_of_measurement": "day"
                }
              }
            },
            "18.8": {
              "category": "Maintenance",
              "activities": {
                "18.8.1": {
                  "activity": "Outdoor Fixture Cleaning",
                  "description": "Cleaning of outdoor lighting fixtures to ensure optimal performance and appearance. This service includes removing dirt and debris from fixtures. Includes comprehensive labor. Ensures clean and efficient lighting fixtures.",
                  "unit_of_measurement": "each"
                },
                "18.8.2": {
                  "activity": "Outdoor Bulb Replacement",
                  "description": "Replacement of outdoor light bulbs to maintain proper lighting. This service includes removing old bulbs and installing new ones. Includes comprehensive labor and rough materials. Ensures consistent and reliable outdoor lighting.",
                  "unit_of_measurement": "each"
                },
                "18.8.3": {
                  "activity": "Outdoor Electrical System Maintenance",
                  "description": "Maintenance of outdoor electrical systems to ensure safety and efficiency. This service includes inspecting, repairing, and maintaining electrical components. Includes comprehensive labor and rough materials. Ensures a well-functioning and safe electrical system.",
                  "unit_of_measurement": "each"
                }
              }
            }
          }
        }
      },
      {
        "19": {
          "section": "Roofing",
          "categories": {
            "19.1": {
              "category": "Leak Repair",
              "activities": {
                "19.1.1": {
                  "activity": "Tile Roofing Repair",
                  "description": "Repair of tile roofing to address damage and prevent leaks. This service includes replacing damaged tiles, securing loose tiles, and ensuring proper sealing. Includes comprehensive labor and rough materials. Ensures durable and leak-free tile roof.",
                  "unit_of_measurement": "each"
                },
                "19.1.2": {
                  "activity": "Flashing Repair",
                  "description": "Repair of roof flashing to prevent water infiltration. This service includes removing damaged flashing, installing new flashing, and sealing joints. Includes comprehensive labor and rough materials. Ensures durable protection against leaks.",
                  "unit_of_measurement": "each"
                },
                "19.1.3": {
                  "activity": "Temporary Leak Repairs",
                  "description": "Temporary repair of roof leaks to provide immediate protection from water damage. This service includes identifying leak sources, applying temporary sealants, and securing the affected area. Includes comprehensive labor and rough materials. Provides short-term leak mitigation until permanent repairs can be made.",
                  "unit_of_measurement": "each"
                },
                "19.1.4": {
                  "activity": "Sheathing Patch/Plug Repair (up to 8 inch x 8 inch)",
                  "description": "Patch or plug repair of roof sheathing for areas up to 8 inches by 8 inches. This service includes removing damaged sheathing, installing new sheathing, and sealing the area. Includes comprehensive labor and rough materials. Ensures structural integrity and leak prevention.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "19.2": {
              "category": "Shingle Roof",
              "activities": {
                "19.2.1": {
                  "activity": "Shingle Roof Removal",
                  "description": "Removal of an existing shingle roof in preparation for new installation. This service includes stripping shingles, disposing of debris, and preparing the roof surface. Includes comprehensive labor and rough materials. Ensures a clean and ready surface for new roofing.",
                  "unit_of_measurement": "sq ft"
                },
                "19.2.2": {
                  "activity": "Laminate Shingle Roof Installation",
                  "description": "Installation of a laminate shingle roof to provide durable and attractive roofing. This service includes placing shingles, nailing, and sealing. Includes comprehensive labor, rough materials, and laminate shingles (client's choice of model and specifications). Ensures a professionally installed and long-lasting shingle roof.",
                  "unit_of_measurement": "sq ft"
                },
                "19.2.3": {
                  "activity": "Cedar Shingles Roof Installation",
                  "description": "Installation of cedar shingles for a natural and aesthetic roof finish. This service includes placing shingles, nailing, and sealing. Includes comprehensive labor, rough materials, and cedar shingles (client's choice of model and specifications). Ensures a beautiful and durable cedar shingle roof.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "19.3": {
              "category": "Metal Roof",
              "activities": {
                "19.3.1": {
                  "activity": "Metal Roof Installation",
                  "description": "Installation of a metal roof for long-lasting and energy-efficient roofing. This service includes placing metal panels, fastening, and sealing. Includes comprehensive labor, rough materials, and metal roof panels (client's choice of model and specifications). Ensures a professionally installed and durable metal roof.",
                  "unit_of_measurement": "sq ft"
                },
                "19.3.2": {
                  "activity": "Metal Roof Painting",
                  "description": "Painting of a metal roof to enhance appearance and protect against corrosion. This service includes surface preparation, priming, and painting. Includes comprehensive labor, rough materials, and paint (client's choice of color and specifications). Ensures a well-protected and aesthetically pleasing metal roof.",
                  "unit_of_measurement": "sq ft"
                },
                "19.3.3": {
                  "activity": "Metal Roof Removal",
                  "description": "Removal of an existing metal roof in preparation for new installation or other projects. This service includes detaching metal panels, disposing of debris, and preparing the roof surface. Includes comprehensive labor and rough materials. Ensures a clean and ready surface for new roofing.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "19.4": {
              "category": "Tile Roof",
              "activities": {
                "19.4.1": {
                  "activity": "Tile Roof Repair",
                  "description": "Repair of a tile roof to address damage and prevent leaks. This service includes replacing damaged tiles, securing loose tiles, and ensuring proper sealing. Includes comprehensive labor and rough materials. Ensures a durable and leak-free tile roof.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "19.5": {
              "category": "Flat Roof",
              "activities": {
                "19.5.1": {
                  "activity": "Elastomeric Roof Coating",
                  "description": "Application of elastomeric roof coating to enhance waterproofing and durability of flat roofs. This service includes surface preparation, coating application, and finishing. Includes comprehensive labor and rough materials. Ensures a protective and long-lasting roof coating.",
                  "unit_of_measurement": "sq ft"
                },
                "19.5.2": {
                  "activity": "Self-Adhering Modified Bitumen Roof Installation",
                  "description": "Installation of self-adhering modified bitumen roofing for enhanced protection. This service includes surface preparation, membrane installation, and sealing. Includes comprehensive labor, rough materials, and modified bitumen membrane (client's choice of specifications). Ensures a durable and waterproof flat roof.",
                  "unit_of_measurement": "sq ft"
                },
                "19.5.3": {
                  "activity": "Bitumen Roof Removal",
                  "description": "Removal of an existing bitumen roof in preparation for new installation or other projects. This service includes stripping the bitumen, disposing of debris, and preparing the roof surface. Includes comprehensive labor and rough materials. Ensures a clean and ready surface for new roofing.",
                  "unit_of_measurement": "sq ft"
                },
                "19.5.4": {
                  "activity": "Silicone Reflective Roof Coating Installation",
                  "description": "Application of silicone reflective roof coating to enhance energy efficiency and durability. This service includes surface preparation, coating application, and finishing. Includes comprehensive labor, rough materials, and silicone reflective coating (client's choice of specifications). Ensures a reflective and protective roof surface.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "19.6": {
              "category": "Roof Inspection",
              "activities": {
                "19.6.1": {
                  "activity": "Roof Leak Detection and Assessment",
                  "description": "Comprehensive inspection to detect and assess roof leaks. This service includes visual inspection, moisture detection, and assessment of leak sources. Includes comprehensive labor and necessary equipment usage. Provides detailed information on roof condition and necessary repairs.",
                  "unit_of_measurement": "each"
                },
                "19.6.2": {
                  "activity": "Comprehensive Roof Inspection",
                  "description": "Thorough inspection of the entire roof to evaluate its condition. This service includes visual inspection, structural assessment, and identification of potential issues. Includes comprehensive labor and necessary equipment usage. Provides a detailed report on roof condition and maintenance needs.",
                  "unit_of_measurement": "each"
                },
                "19.6.3": {
                  "activity": "Roof Damage Inspection",
                  "description": "Detailed inspection to identify and assess roof damage. This service includes visual inspection, structural assessment, and damage documentation. Includes comprehensive labor and necessary equipment usage. Provides detailed information on roof damage and recommended repairs.",
                  "unit_of_measurement": "each"
                },
                "19.6.4": {
                  "activity": "Gutter and Drainage Evaluation",
                  "description": "Inspection and evaluation of the gutter and drainage system to ensure proper functionality. This service includes visual inspection, flow testing, and identification of blockages or damage. Includes comprehensive labor and necessary equipment usage. Provides a detailed report on gutter and drainage system condition and maintenance needs.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "19.7": {
              "category": "Gutter",
              "activities": {
                "19.7.1": {
                  "activity": "Gutter Downspout Installation",
                  "description": "Installation of gutter downspouts to ensure proper water drainage. This service includes mounting downspouts, securing connections, and testing for proper flow. Includes comprehensive labor, rough materials, and downspouts (client's choice of model and specifications). Ensures effective water drainage from gutters.",
                  "unit_of_measurement": "lin ft"
                },
                "19.7.2": {
                  "activity": "Edge and Gutter Installation for Single-Story House",
                  "description": "Installation of drip edges and gutters on single-story houses to protect the roof and foundation. This service includes mounting drip edges, installing gutters, and securing connections. Includes comprehensive labor, rough materials, and gutters (client's choice of model and specifications). Ensures effective water management and roof protection.",
                  "unit_of_measurement": "lin ft"
                },
                "19.7.3": {
                  "activity": "Edge and Gutter Installation for 2-3 Story Houses",
                  "description": "Installation of drip edges and gutters on 2-3 story houses to protect the roof and foundation. This service includes mounting drip edges, installing gutters, and securing connections. Includes comprehensive labor, rough materials, and gutters (client's choice of model and specifications). Ensures effective water management and roof protection.",
                  "unit_of_measurement": "lin ft"
                },
                "19.7.4": {
                  "activity": "Gutter Repair",
                  "description": "Repair of existing gutters to restore functionality and prevent leaks. This service includes identifying damage, replacing or securing damaged sections, and testing for proper flow. Includes comprehensive labor and rough materials. Ensures fully functional and leak-free gutters.",
                  "unit_of_measurement": "each"
                },
                "19.7.5.": {
                  "activity": "Gutter Removal",
                  "description": "Removal of existing gutters in preparation for new installation or other projects. This service includes detaching gutters, disposing of debris, and preparing the structure for new gutters. Includes comprehensive labor and rough materials. Ensures a clean and ready surface for new gutter installation.",
                  "unit_of_measurement": "lin ft"
                }
              }
            },
            "19.8": {
              "category": "Roof Ventilation",
              "activities": {
                "19.8.1": {
                  "activity": "Ridge Vent Installation",
                  "description": "Installation of a ridge vent to enhance roof ventilation. This service includes cutting the roof ridge, installing the vent, and securing it properly. Includes comprehensive labor, rough materials, and ridge vent (client's choice of model and specifications). Ensures effective ventilation for the attic.",
                  "unit_of_measurement": "lin ft"
                },
                "19.8.2": {
                  "activity": "Gravity Roof Ventilator Installation",
                  "description": "Installation of a gravity roof ventilator to improve air circulation. This service includes mounting the ventilator, securing it, and ensuring proper airflow. Includes comprehensive labor, rough materials, and gravity roof ventilator (client's choice of model and specifications). Provides natural ventilation for the attic.",
                  "unit_of_measurement": "each"
                },
                "19.8.3": {
                  "activity": "Static Ventilator Installation",
                  "description": "Installation of a static ventilator to enhance attic ventilation. This service includes mounting the ventilator, securing it, and ensuring proper airflow. Includes comprehensive labor, rough materials, and static ventilator (client's choice of model and specifications). Ensures continuous ventilation without moving parts.",
                  "unit_of_measurement": "each"
                },
                "19.8.4": {
                  "activity": "Solar Powered Attic Fan Installation",
                  "description": "Installation of a solar-powered attic fan to improve ventilation using solar energy. This service includes mounting the fan, connecting solar panels, and ensuring proper operation. Includes comprehensive labor, rough materials, and solar-powered attic fan (client's choice of model and specifications). Provides energy-efficient attic ventilation.",
                  "unit_of_measurement": "each"
                },
                "19.8.5": {
                  "activity": "Roof Turbines Installation",
                  "description": "Installation of roof turbines to enhance attic ventilation. This service includes mounting the turbines, securing them, and ensuring proper airflow. Includes comprehensive labor, rough materials, and roof turbines (client's choice of model and specifications). Ensures effective ventilation through wind-powered turbines.",
                  "unit_of_measurement": "each"
                },
                "19.8.6": {
                  "activity": "Roof Ventilation Maintenance",
                  "description": "Maintenance of existing roof ventilation systems to ensure optimal performance. This service includes cleaning, inspecting, and repairing ventilation components as needed. Includes comprehensive labor and necessary materials. Ensures continued effective ventilation for the attic.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "19.9": {
              "category": "Skylight",
              "activities": {
                "19.9.1": {
                  "activity": "Tubular Skylights Installation",
                  "description": "Installation of tubular skylights to bring natural light into interior spaces. This service includes cutting the roof, installing the skylight tubes, and sealing them properly. Includes comprehensive labor, rough materials, and tubular skylights (client's choice of model and specifications). Enhances interior lighting with natural sunlight.",
                  "unit_of_measurement": "each"
                },
                "19.9.2": {
                  "activity": "Fixed Skylight Installation",
                  "description": "Installation of fixed skylights to provide natural light. This service includes cutting the roof, installing the skylight, and sealing it properly. Includes comprehensive labor, rough materials, and fixed skylights (client's choice of model and specifications). Ensures a durable and well-sealed skylight.",
                  "unit_of_measurement": "each"
                },
                "19.9.3": {
                  "activity": "Venting Skylight Installation",
                  "description": "Installation of venting skylights to provide natural light and ventilation. This service includes cutting the roof, installing the skylight, and sealing it properly. Includes comprehensive labor, rough materials, and venting skylights (client's choice of model and specifications). Provides natural light and ventilation.",
                  "unit_of_measurement": "each"
                },
                "19.9.4": {
                  "activity": "Curb-Mount Skylight Installation",
                  "description": "Installation of curb-mount skylights for enhanced natural light. This service includes building the curb, installing the skylight, and sealing it properly. Includes comprehensive labor, rough materials, and curb-mount skylights (client's choice of model and specifications). Ensures a secure and well-sealed skylight.",
                  "unit_of_measurement": "each"
                },
                "19.9.5": {
                  "activity": "Skylight Removal",
                  "description": "Removal of existing skylights in preparation for new installation or other projects. This service includes detaching the skylight, disposing of debris, and sealing the roof opening. Includes comprehensive labor and necessary materials. Ensures a clean and ready surface for new skylight installation.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "19.10": {
              "category": "Sheathing",
              "activities": {
                "19.10.1": {
                  "activity": "OSB Sheathing Install",
                  "description": "Installation of OSB sheathing for structural support. This service includes cutting and securing the OSB panels to the roof or walls. Includes comprehensive labor, rough materials, and OSB sheathing (client's choice of specifications). Provides a sturdy and reliable sheathing layer.",
                  "unit_of_measurement": "sq ft"
                },
                "19.10.2": {
                  "activity": "Plywood Sheathing Installation",
                  "description": "Installation of plywood sheathing for structural support. This service includes cutting and securing the plywood panels to the roof or walls. Includes comprehensive labor, rough materials, and plywood sheathing (client's choice of specifications). Ensures a strong and durable sheathing layer.",
                  "unit_of_measurement": "sq ft"
                },
                "19.10.3": {
                  "activity": "Steep Roof Plywood Sheathing Installation",
                  "description": "Installation of plywood sheathing on steep roofs for structural support. This service includes cutting and securing the plywood panels to the roof. Includes comprehensive labor, rough materials, and plywood sheathing (client's choice of specifications). Provides a sturdy and reliable sheathing layer on steep roofs.",
                  "unit_of_measurement": "sq ft"
                },
                "19.10.4": {
                  "activity": "Steep Roof OSB Sheathing Installation",
                  "description": "Installation of OSB sheathing on steep roofs for structural support. This service includes cutting and securing the OSB panels to the roof. Includes comprehensive labor, rough materials, and OSB sheathing (client's choice of specifications). Ensures a strong and durable sheathing layer on steep roofs.",
                  "unit_of_measurement": "sq ft"
                },
                "19.10.5": {
                  "activity": "OSB Sheathing Removal",
                  "description": "Removal of existing OSB sheathing in preparation for new installation or other projects. This service includes detaching the OSB panels, disposing of debris, and preparing the surface. Includes comprehensive labor and necessary materials. Ensures a clean and ready surface for new sheathing installation.",
                  "unit_of_measurement": "sq ft"
                },
                "19.10.6": {
                  "activity": "Plywood Sheathing Removal",
                  "description": "Removal of existing plywood sheathing in preparation for new installation or other projects. This service includes detaching the plywood panels, disposing of debris, and preparing the surface. Includes comprehensive labor and necessary materials. Ensures a clean and ready surface for new sheathing installation.",
                  "unit_of_measurement": "sq ft"
                }
              }
            }
          }
        }
      },
      {
        "20": {
          "section": "Landscaping",
          "categories": {
            "20.1": {
              "category": "Lawn Maintenance",
              "activities": {
                "20.1.1": {
                  "activity": "Regular Lawn Mowing",
                  "description": "Regular mowing of the lawn to maintain an even and well-kept appearance. This service includes mowing the lawn, trimming the edges, and clearing away grass clippings. Includes comprehensive labor and necessary equipment. Ensures a consistently neat and tidy lawn.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.1.2": {
                  "activity": "Lawn Edging and Trimming",
                  "description": "Edging and trimming the lawn to create clean lines along borders and pathways. This service includes using specialized tools to trim grass edges and clean up borders. Includes comprehensive labor and necessary equipment. Provides a polished and professional look to lawn edges.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.1.3": {
                  "activity": "Lawn Aeration and Scarifying",
                  "description": "Aerating and scarifying the lawn to improve soil health and promote grass growth. This service includes perforating the soil and removing thatch buildup. Includes comprehensive labor, rough materials, and necessary equipment. Enhances lawn health and appearance.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.1.4": {
                  "activity": "Spring Lawn Revitalization",
                  "description": "Revitalizing the lawn in spring to prepare it for the growing season. This service includes aeration, fertilization, overseeding, and weed control. Includes comprehensive labor, rough materials, and necessary equipment. Ensures a healthy and vibrant lawn for the year ahead.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.1.5": {
                  "activity": "Autumn Lawn Preparation",
                  "description": "Preparing the lawn for the winter season to promote healthy growth in spring. This service includes aeration, fertilization, overseeding, and removing fallen leaves. Includes comprehensive labor, rough materials, and necessary equipment. Prepares the lawn to withstand winter conditions.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.1.6": {
                  "activity": "Lawn Winterization",
                  "description": "Winterizing the lawn to protect it from harsh winter conditions. This service includes applying winter fertilizer, mowing to an appropriate height, and clearing debris. Includes comprehensive labor, rough materials, and necessary equipment. Ensures the lawn is ready for winter and healthy regrowth in spring.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.1.7": {
                  "activity": "Faded Grass Painting",
                  "description": "Painting faded grass areas to restore a vibrant green color. This service includes applying eco-friendly grass paint to discolored patches. Includes comprehensive labor and necessary materials. Provides an instantly refreshed and lush-looking lawn.",
                  "unit_of_measurement": "K sq ft"
                }
              }
            },
            "20.2": {
              "category": "Lawn Seeding",
              "activities": {
                "20.2.1": {
                  "activity": "Lawn Hand Seeding",
                  "description": "Hand seeding the lawn to promote new grass growth in bare or thin areas. This service includes preparing the soil, applying grass seed, and covering the seeds with soil or mulch. Includes comprehensive labor, rough materials, and necessary equipment. Ensures even and effective grass growth.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.2.2": {
                  "activity": "Lawn Hydroseeding",
                  "description": "Applying a hydroseeding mixture to promote rapid grass growth. This service includes spraying a mixture of seed, fertilizer, and mulch onto the lawn. Includes comprehensive labor, rough materials, and necessary equipment. Provides a quick and efficient way to establish a new lawn.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.2.3": {
                  "activity": "Lawn Sod Installation",
                  "description": "Installing sod to create an instant, fully-grown lawn. This service includes soil preparation, laying sod, and watering. Includes comprehensive labor, rough materials, and sod (client's choice of type and specifications). Provides an immediate and professional lawn finish.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.2.4": {
                  "activity": "Artificial Grass Installation",
                  "description": "Installing artificial grass for a low-maintenance and evergreen lawn. This service includes preparing the base, laying artificial grass, and securing it in place. Includes comprehensive labor, rough materials, and artificial grass (client's choice of type and specifications). Provides a durable and maintenance-free lawn solution.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.2.5": {
                  "activity": "Lawn Edging Installation",
                  "description": "Installing edging around the lawn to define borders and prevent grass spread. This service includes digging trenches, placing edging materials, and securing them. Includes comprehensive labor, rough materials, and edging materials (client's choice of type and specifications). Provides a clean and defined lawn edge.",
                  "unit_of_measurement": "lin ft"
                }
              }
            },
            "20.3": {
              "category": "Tree Pruning",
              "activities": {
                "20.3.1": {
                  "activity": "Tree Removal (Under 12' Diameter, Large Canopy)",
                  "description": "Removal of a tree with a diameter under 12 inches and a large canopy. This service includes cutting down the tree, removing branches and debris, and grinding the stump. Includes comprehensive labor, rough materials, and necessary equipment. Ensures safe and efficient tree removal.",
                  "unit_of_measurement": "each"
                },
                "20.3.2": {
                  "activity": "Tree Removal (12' to 24' Diameter, Large Canopy)",
                  "description": "Removal of a tree with a diameter between 12 and 24 inches and a large canopy. This service includes cutting down the tree, removing branches and debris, and grinding the stump. Includes comprehensive labor, rough materials, and necessary equipment. Ensures safe and efficient tree removal.",
                  "unit_of_measurement": "each"
                },
                "20.3.3": {
                  "activity": "Tree Removal (24' to 36' Diameter, Large Canopy)",
                  "description": "Removal of a tree with a diameter between 24 and 36 inches and a large canopy. This service includes cutting down the tree, removing branches and debris, and grinding the stump. Includes comprehensive labor, rough materials, and necessary equipment. Ensures safe and efficient tree removal.",
                  "unit_of_measurement": "each"
                },
                "20.3.4": {
                  "activity": "Tree Stump Grinding",
                  "description": "Grinding of a tree stump to below ground level. This service includes grinding the stump and removing the debris. Includes comprehensive labor, rough materials, and necessary equipment. Ensures the stump is fully ground, and the area is ready for new planting or landscaping.",
                  "unit_of_measurement": "each"
                },
                "20.3.5": {
                  "activity": "Tree Formative Pruning",
                  "description": "Pruning young trees to encourage healthy growth and shape. This service includes selectively removing branches to improve structure and aesthetics. Includes comprehensive labor, rough materials, and necessary equipment. Promotes healthy tree growth and appearance.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "20.4": {
              "category": "Planting",
              "activities": {
                "20.4.1": {
                  "activity": "Small Tree Planting (Up to 2' Tall)",
                  "description": "Planting small trees up to 2 feet tall. This service includes digging holes, planting trees, and adding soil and mulch. Includes comprehensive labor, rough materials, and necessary equipment. Ensures proper planting and establishment of young trees.",
                  "unit_of_measurement": "each"
                },
                "20.4.2": {
                  "activity": "Medium Tree Planting (3' to 5' Tall)",
                  "description": "Planting medium-sized trees between 3 and 5 feet tall. This service includes digging holes, planting trees, and adding soil and mulch. Includes comprehensive labor, rough materials, and necessary equipment. Ensures proper planting and establishment of medium-sized trees.",
                  "unit_of_measurement": "each"
                },
                "20.4.3": {
                  "activity": "Large Tree Planting (Over 6' Tall)",
                  "description": "Planting large trees over 6 feet tall. This service includes digging holes, planting trees, and adding soil and mulch. Includes comprehensive labor, rough materials, and necessary equipment. Ensures proper planting and establishment of large trees.",
                  "unit_of_measurement": "each"
                },
                "20.4.4": {
                  "activity": "Medium Size Tree Relocation",
                  "description": "Relocating medium-sized trees to a new location. This service includes digging up the tree, transporting it, and replanting it in a new location. Includes comprehensive labor, rough materials, and necessary equipment. Ensures safe and successful tree relocation.",
                  "unit_of_measurement": "each"
                },
                "20.4.5": {
                  "activity": "Shrubs Planting",
                  "description": "Planting various types of shrubs. This service includes digging holes, planting shrubs, and adding soil and mulch. Includes comprehensive labor, rough materials, and necessary equipment. Ensures proper planting and establishment of shrubs.",
                  "unit_of_measurement": "each"
                },
                "20.4.6": {
                  "activity": "Perennial Grasses Planting",
                  "description": "Planting perennial grasses to enhance landscape aesthetics. This service includes preparing the soil, planting grasses, and adding mulch. Includes comprehensive labor, rough materials, and necessary equipment. Promotes healthy growth and establishment of perennial grasses.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "20.5": {
              "category": "Mulching",
              "activities": {
                "20.5.1": {
                  "activity": "Organic Mulching (Up to 3' Deep)",
                  "description": "Applying organic mulch up to 3 inches deep to garden beds and around plants. This service includes spreading mulch evenly to retain moisture and suppress weeds. Includes comprehensive labor, rough materials, and necessary equipment. Enhances soil health and plant growth.",
                  "unit_of_measurement": "sq ft"
                },
                "20.5.2": {
                  "activity": "Organic Mulching for Playgrounds",
                  "description": "Applying organic mulch to playground areas for safety and aesthetics. This service includes spreading mulch to the appropriate depth and ensuring even coverage. Includes comprehensive labor, rough materials, and necessary equipment. Provides a safe and attractive play area surface.",
                  "unit_of_measurement": "sq ft"
                },
                "20.5.3": {
                  "activity": "Pea Gravel Pebble Mulching",
                  "description": "Applying pea gravel or pebble mulch to garden beds and pathways. This service includes spreading gravel or pebbles evenly for decorative and functional purposes. Includes comprehensive labor, rough materials, and necessary equipment. Enhances landscape appearance and functionality.",
                  "unit_of_measurement": "sq ft"
                },
                "20.5.4": {
                  "activity": "Mulch Replacement and Top-Up",
                  "description": "Replacing old mulch and adding a fresh layer to garden beds and around plants. This service includes removing old mulch, applying new mulch, and ensuring even coverage. Includes comprehensive labor, rough materials, and necessary equipment. Maintains a neat and healthy garden appearance.",
                  "unit_of_measurement": "sq ft"
                },
                "20.5.5": {
                  "activity": "Mulch Color Covering",
                  "description": "Applying colored mulch to garden beds and around plants. This service includes spreading colored mulch evenly to enhance landscape aesthetics. Includes comprehensive labor, rough materials, and necessary equipment. Provides a vibrant and polished look to the garden.",
                  "unit_of_measurement": "sq ft"
                },
                "20.5.6": {
                  "activity": "Mulch Removal",
                  "description": "Removing old or unwanted mulch from garden beds and around plants. This service includes collecting and disposing of mulch debris. Includes comprehensive labor, rough materials, and necessary equipment. Ensures clean and mulch-free garden beds.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "20.6": {
              "category": "Landscape Rocks",
              "activities": {
                "20.6.1": {
                  "activity": "Ground Cover Rocks Installation",
                  "description": "Installation of ground cover rocks to enhance landscape aesthetics and prevent soil erosion. This service includes laying ground cover rocks evenly across designated areas. Includes comprehensive labor, rough materials, equipment usage, and ground cover rocks (client's choice of type and color). Ensures a well-distributed and attractive ground cover.",
                  "unit_of_measurement": "sq ft"
                },
                "20.6.2": {
                  "activity": "Erosion Control Rocks Installation",
                  "description": "Installation of erosion control rocks to prevent soil erosion on slopes and other vulnerable areas. This service includes placing rocks strategically to stabilize soil. Includes comprehensive labor, rough materials, equipment usage, and erosion control rocks (client's choice of type and color). Ensures effective erosion control and landscape stability.",
                  "unit_of_measurement": "cu ft"
                },
                "20.6.3": {
                  "activity": "Rock Wall Installation",
                  "description": "Construction of rock walls for decorative or retaining purposes. This service includes sourcing and stacking rocks to create a stable wall structure. Includes comprehensive labor, rough materials, equipment usage, and rocks for the wall (client's choice of type and color). Provides a durable and visually appealing rock wall.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "20.7": {
              "category": "Edging",
              "activities": {
                "20.7.1": {
                  "activity": "Install Plastic Landscape Edging",
                  "description": "Installation of plastic landscape edging to define garden beds and pathways. This service includes measuring, cutting, and securing plastic edging in place. Includes comprehensive labor, rough materials, equipment usage, and plastic edging (client's choice of type and color). Ensures clean and distinct landscape borders.",
                  "unit_of_measurement": "lin ft"
                },
                "20.7.2": {
                  "activity": "Install Metal Landscape Edging",
                  "description": "Installation of metal landscape edging for a sleek and durable garden border. This service includes measuring, cutting, and securing metal edging. Includes comprehensive labor, rough materials, equipment usage, and metal edging (client's choice of type and color). Provides a long-lasting and modern landscape edge.",
                  "unit_of_measurement": "lin ft"
                },
                "20.7.3": {
                  "activity": "Install Natural Stone Landscape Edging",
                  "description": "Installation of natural stone landscape edging for a rustic and natural garden border. This service includes measuring, cutting, and securing natural stone edging. Includes comprehensive labor, rough materials, equipment usage, and natural stone edging (client's choice of type and color). Ensures a visually appealing and durable landscape edge.",
                  "unit_of_measurement": "lin ft"
                },
                "20.7.4": {
                  "activity": "Install Brick Landscape Edging",
                  "description": "Installation of brick landscape edging to add a classic and durable border to garden beds and pathways. This service includes measuring, cutting, and securing brick edging. Includes comprehensive labor, rough materials, equipment usage, and brick edging (client's choice of type and color). Provides a traditional and sturdy landscape edge.",
                  "unit_of_measurement": "lin ft"
                },
                "20.7.5": {
                  "activity": "Install Wood Landscape Edging",
                  "description": "Installation of wood landscape edging for a natural and flexible garden border. This service includes measuring, cutting, and securing wood edging. Includes comprehensive labor, rough materials, equipment usage, and wood edging (client's choice of type and finish). Ensures a rustic and adaptable landscape edge.",
                  "unit_of_measurement": "lin ft"
                },
                "20.7.6": {
                  "activity": "Install Paver Landscape Edging",
                  "description": "Installation of paver landscape edging to create a clean and durable border for garden beds and pathways. This service includes measuring, cutting, and securing paver edging. Includes comprehensive labor, rough materials, equipment usage, and paver edging (client's choice of type and color). Provides a polished and resilient landscape edge.",
                  "unit_of_measurement": "lin ft"
                }
              }
            },
            "20.8": {
              "category": "Garden Beds",
              "activities": {
                "20.8.1": {
                  "activity": "Raised Garden Bed Installation (Wood)",
                  "description": "Installation of a wooden raised garden bed for enhanced gardening. This service includes assembling and positioning the wooden bed structure. Includes comprehensive labor, rough materials, equipment usage, and wooden garden bed materials (client's choice of type and finish). Ensures a durable and attractive garden bed.",
                  "unit_of_measurement": "sq ft"
                },
                "20.8.2": {
                  "activity": "Raised Garden Bed Installation (Corten Steel)",
                  "description": "Installation of a corten steel raised garden bed for modern and durable gardening. This service includes assembling and positioning the corten steel bed structure. Includes comprehensive labor, rough materials, equipment usage, and corten steel garden bed materials (client's choice of size and design). Provides a sleek and long-lasting garden bed.",
                  "unit_of_measurement": "sq ft"
                },
                "20.8.3": {
                  "activity": "Raised Garden Bed Installation (Galvanized Steel)",
                  "description": "Installation of a galvanized steel raised garden bed for robust and contemporary gardening. This service includes assembling and positioning the galvanized steel bed structure. Includes comprehensive labor, rough materials, equipment usage, and galvanized steel garden bed materials (client's choice of size and design). Ensures a sturdy and modern garden bed.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "20.9": {
              "category": "Hedge",
              "activities": {
                "20.9.1": {
                  "activity": "Hedge Planting",
                  "description": "Planting of hedges to create natural privacy screens or decorative garden borders. This service includes digging, planting, and initial care. Includes comprehensive labor, rough materials, equipment usage, and hedges (client's choice of type and size). Ensures healthy and well-planted hedges.",
                  "unit_of_measurement": "each"
                },
                "20.9.2": {
                  "activity": "Hedge Pruning",
                  "description": "Pruning of hedges to maintain shape, health, and appearance. This service includes trimming and removal of excess growth. Includes comprehensive labor, rough materials, and necessary equipment. Ensures well-maintained and attractive hedges.",
                  "unit_of_measurement": "hour"
                }
              }
            },
            "20.10": {
              "category": "Walkway and Path",
              "activities": {
                "20.10.1": {
                  "activity": "Natural Path Installation",
                  "description": "Installation of a natural path using materials such as wood chips or mulch. This service includes site preparation, material placement, and compaction. Includes comprehensive labor, rough materials, equipment usage, and natural path materials (client's choice of type). Ensures an eco-friendly and natural walkway.",
                  "unit_of_measurement": "sq ft"
                },
                "20.10.2": {
                  "activity": "Concrete Walkway and Path Installation",
                  "description": "Installation of a concrete walkway or path for a durable and long-lasting surface. This service includes preparation, formwork, pouring, and finishing. Includes comprehensive labor, rough materials, equipment usage, and concrete (client's choice of finish). Provides a sturdy and low-maintenance walkway.",
                  "unit_of_measurement": "sq ft"
                },
                "20.10.3": {
                  "activity": "Pavers Walkway and Path Installation",
                  "description": "Installation of a pavers walkway or path for a decorative and durable surface. This service includes site preparation, base material placement, and paver installation. Includes comprehensive labor, rough materials, equipment usage, and pavers (client's choice of type and color). Ensures a visually appealing and robust walkway.",
                  "unit_of_measurement": "sq ft"
                },
                "20.10.4": {
                  "activity": "Brick Walkway and Path Installation",
                  "description": "Installation of a brick walkway or path for a classic and timeless look. This service includes site preparation, base material placement, and brick installation. Includes comprehensive labor, rough materials, equipment usage, and bricks (client's choice of type and color). Provides a traditional and durable walkway.",
                  "unit_of_measurement": "sq ft"
                },
                "20.10.5": {
                  "activity": "Stepping Stone Walkway and Path Installation",
                  "description": "Installation of a stepping stone walkway or path for a natural and aesthetic look. This service includes site preparation, base material placement, and stepping stone installation. Includes comprehensive labor, rough materials, equipment usage, and stepping stones (client's choice of type and color). Ensures a charming and practical walkway.",
                  "unit_of_measurement": "lin ft"
                },
                "20.10.6": {
                  "activity": "Crushed Stone or Gravel Path Installation",
                  "description": "Installation of a crushed stone or gravel path for a versatile and cost-effective surface. This service includes site preparation, base material placement, and spreading of crushed stone or gravel. Includes comprehensive labor, rough materials, equipment usage, and crushed stone or gravel (client's choice of type and color). Provides a durable and low-maintenance walkway.",
                  "unit_of_measurement": "sq ft"
                },
                "20.10.7": {
                  "activity": "Surface Maintenance and Weed Control",
                  "description": "Regular maintenance of walkways and paths to prevent weed growth and maintain surface integrity. This service includes weed removal, surface cleaning, and minor repairs. Includes comprehensive labor, rough materials, and necessary equipment. Ensures a clean and well-maintained walkway.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "20.11": {
              "category": "Water Features",
              "activities": {
                "20.11.1": {
                  "activity": "Small Landscape Fountain Installation",
                  "description": "Installation of a small landscape fountain to enhance garden aesthetics. This service includes site preparation, plumbing, and fountain setup. Includes comprehensive labor, rough materials, equipment usage, and fountain (client's choice of model and design). Provides a tranquil and attractive water feature.",
                  "unit_of_measurement": "each"
                },
                "20.11.2": {
                  "activity": "Preformed Pond Installation",
                  "description": "Installation of a preformed pond for a ready-made water feature. This service includes site excavation, pond placement, and finishing. Includes comprehensive labor, rough materials, equipment usage, and preformed pond (client's choice of size and design). Ensures a quick and visually appealing pond installation.",
                  "unit_of_measurement": "each"
                },
                "20.11.3": {
                  "activity": "Ponds and Fountains Maintenance",
                  "description": "Regular maintenance of ponds and fountains to ensure proper operation and aesthetics. This service includes cleaning, water treatment, and minor repairs. Includes comprehensive labor, rough materials, and necessary equipment. Ensures a well-maintained and functional water feature.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "20.12": {
              "category": "Irrigation System",
              "activities": {
                "20.12.1": {
                  "activity": "Sprinkler Systems Installation",
                  "description": "Installation of a sprinkler system for efficient lawn and garden watering. This service includes site assessment, system design, trenching, and installation. Includes comprehensive labor, rough materials, equipment usage, and sprinkler system components (client's choice of brand and features). Ensures a reliable and efficient irrigation system.",
                  "unit_of_measurement": "K sq ft"
                },
                "20.12.2": {
                  "activity": "Irrigation Timers and Controllers Installation",
                  "description": "Installation of timers and controllers for automated irrigation systems. This service includes connecting controllers to the irrigation system and programming settings. Includes comprehensive labor, rough materials, equipment usage, and timers/controllers (client's choice of brand and features). Provides automated and efficient watering control.",
                  "unit_of_measurement": "each"
                },
                "20.12.3": {
                  "activity": "Drip Irrigation System Installation",
                  "description": "Installation of a drip irrigation system for precise watering of plants and garden beds. This service includes system layout, tubing installation, and emitter placement. Includes comprehensive labor, rough materials, equipment usage, and drip irrigation components (client's choice of brand and design). Ensures water-efficient and targeted irrigation.",
                  "unit_of_measurement": "lin ft"
                },
                "20.12.4": {
                  "activity": "Raised Bed Garden Drip Irrigation System Installation",
                  "description": "Installation of a drip irrigation system specifically for raised bed gardens. This service includes system layout, tubing installation, and emitter placement. Includes comprehensive labor, rough materials, equipment usage, and drip irrigation components (client's choice of brand and design). Provides efficient watering for raised bed gardens.",
                  "unit_of_measurement": "lin ft"
                },
                "20.12.5": {
                  "activity": "Irrigation System Winterization",
                  "description": "Winterization of irrigation systems to prevent damage from freezing temperatures. This service includes draining water from the system and protecting components. Includes comprehensive labor, rough materials, and necessary equipment. Ensures irrigation system is protected during winter months.",
                  "unit_of_measurement": "each"
                },
                "20.12.6": {
                  "activity": "Irrigation System Maintenance",
                  "description": "Regular maintenance of irrigation systems to ensure proper operation. This service includes system inspection, cleaning, and minor repairs. Includes comprehensive labor, rough materials, and necessary equipment. Ensures a well-maintained and efficient irrigation system.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "20.13": {
              "category": "Drainage",
              "activities": {
                "20.13.1": {
                  "activity": "French Drain System Installation",
                  "description": "Installation of a French drain system to effectively manage surface water. This service includes site assessment, trenching, pipe installation, and gravel backfilling. Includes comprehensive labor, rough materials, equipment usage, and French drain components (client's choice of type). Ensures efficient water drainage and prevention of water accumulation.",
                  "unit_of_measurement": "lin ft"
                },
                "20.13.2": {
                  "activity": "Downspout Runoff Installation",
                  "description": "Installation of downspout runoff extensions to direct water away from the foundation. This service includes attachment to existing downspouts and extension placement. Includes comprehensive labor, rough materials, and downspout extensions (client's choice of type). Provides effective management of roof water runoff.",
                  "unit_of_measurement": "each"
                },
                "20.13.3": {
                  "activity": "Landscape Drainage Solutions Installation",
                  "description": "Installation of drainage solutions to manage water in landscaped areas. This service includes site assessment, trenching, and installation of drainage components. Includes comprehensive labor, rough materials, equipment usage, and drainage components (client's choice of type). Ensures effective water management in gardens and landscaped areas.",
                  "unit_of_measurement": "each"
                },
                "20.13.4": {
                  "activity": "Driveway Drainage Solutions Installation",
                  "description": "Installation of drainage solutions to prevent water accumulation on driveways. This service includes assessment, trenching, and installation of drainage components. Includes comprehensive labor, rough materials, and drainage components (client's choice of type). Provides effective water management for driveways.",
                  "unit_of_measurement": "each"
                },
                "20.13.5": {
                  "activity": "Yard Drainage Solutions Installation",
                  "description": "Installation of yard drainage solutions to manage surface water. This service includes site assessment, trenching, and installation of drainage components. Includes comprehensive labor, rough materials, equipment usage, and drainage components (client's choice of type). Ensures effective water drainage in yards.",
                  "unit_of_measurement": "each"
                },
                "20.13.6": {
                  "activity": "Drainage System Cleaning",
                  "description": "Cleaning and maintenance of existing drainage systems to ensure proper function. This service includes debris removal, flushing, and inspection of drainage components. Includes comprehensive labor, rough materials, and necessary equipment. Ensures efficient and reliable drainage system performance.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "20.14": {
              "category": "Greenhouses",
              "activities": {
                "20.14.1": {
                  "activity": "Aluminum Frame Greenhouse Installation",
                  "description": "Installation of an aluminum frame greenhouse for growing plants. This service includes site preparation, frame assembly, and panel installation. Includes comprehensive labor, rough materials, equipment usage, and greenhouse components (client's choice of type and size). Provides a durable and efficient greenhouse structure.",
                  "unit_of_measurement": "sq ft"
                },
                "20.14.2": {
                  "activity": "Metal Orangery Installation",
                  "description": "Installation of a metal orangery for growing citrus and other plants. This service includes site preparation, frame assembly, and panel installation. Includes comprehensive labor, rough materials, equipment usage, and orangery components (client's choice of type and size). Ensures a robust and aesthetically pleasing orangery structure.",
                  "unit_of_measurement": "sq ft"
                },
                "20.14.3": {
                  "activity": "Greenhouse Seasonal Cleaning",
                  "description": "Seasonal cleaning of greenhouses to maintain optimal growing conditions. This service includes debris removal, surface cleaning, and inspection of greenhouse components. Includes comprehensive labor, rough materials, and necessary equipment. Ensures a clean and well-maintained greenhouse environment.",
                  "unit_of_measurement": "sq ft"
                }
              }
            }
          }
        }
      },
      {
        "22": {
          "section": "Appliance",
          "categories": {
            "22.1": {
              "category": "Grills",
              "activities": {
                "22.1.1": {
                  "activity": "Outdoor Grill Assembly",
                  "description": "Assembly of an outdoor grill to provide a convenient cooking solution. This service includes unpacking, parts verification, and complete assembly according to the manufacturer's instructions. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures the grill is correctly and securely assembled, ready for use.",
                  "unit_of_measurement": "sq ft"
                },
                "22.1.2": {
                  "activity": "Outdoor Grill Cleaning",
                  "description": "Thorough cleaning of an outdoor grill to maintain optimal performance and hygiene. This service includes cleaning grill grates, burners, and exterior surfaces. Includes comprehensive labor, rough materials, and necessary cleaning equipment. Ensures the grill is clean and well-maintained for safe and efficient use.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "22.2": {
              "category": "Outdoor Kitchen",
              "activities": {
                "22.2.1": {
                  "activity": "Outdoor Kitchen Cabinets Installation",
                  "description": "Installation of outdoor kitchen cabinets to provide storage and workspace. This service includes site preparation, cabinet assembly, and secure mounting. Includes comprehensive labor, rough materials, equipment usage, and cabinet components (client's choice of type and design). Ensures a functional and aesthetically pleasing outdoor kitchen setup.",
                  "unit_of_measurement": "lin ft"
                },
                "22.2.2": {
                  "activity": "Outdoor Kitchen Built-In Grill Installation",
                  "description": "Installation of a built-in grill in an outdoor kitchen setup. This service includes site preparation, grill placement, and secure mounting. Includes comprehensive labor, rough materials, equipment usage, and built-in grill components (client's choice of model and specifications). Ensures a seamless and functional grill installation.",
                  "unit_of_measurement": "each"
                },
                "22.2.3": {
                  "activity": "Outdoor Gas Grill Island Installation",
                  "description": "Installation of a Gas Grill Island in an outdoor kitchen setup. This service includes site preparation, grill placement, and secure mounting. Includes comprehensive labor, rough materials, equipment usage, and built-in grill components (client's choice of model and specifications). Ensures a seamless and functional grill installation.",
                  "unit_of_measurement": "each"
                },
                "22.2.4": {
                  "activity": "Outdoor Kitchen Sink Installation",
                  "description": "Installation of a sink in an outdoor kitchen to provide a convenient water source. This service includes site preparation, plumbing connections, and secure mounting. Includes comprehensive labor, rough materials, equipment usage, and sink components (client's choice of model and specifications). Ensures a functional and efficient sink installation.",
                  "unit_of_measurement": "each"
                },
                "22.2.5": {
                  "activity": "Outdoor Kitchen Cleaning",
                  "description": "Thorough cleaning of an outdoor kitchen to maintain hygiene and functionality. This service includes cleaning countertops, cabinets, appliances, and sinks. Includes comprehensive labor, rough materials, and necessary cleaning equipment. Ensures the outdoor kitchen is clean and ready for use.",
                  "unit_of_measurement": "each"
                },
                "22.2.6": {
                  "activity": "Outdoor Kitchen Removal",
                  "description": "Safe removal of an outdoor kitchen setup. This service includes disassembly of cabinets, appliances, and plumbing fixtures, followed by site cleanup. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures efficient and clean removal of the outdoor kitchen.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "22.3": {
              "category": "Fire Pit",
              "activities": {
                "22.3.1": {
                  "activity": "Fire Pit Kit Installation",
                  "description": "Installation of a fire pit kit to provide a convenient outdoor heating solution. This service includes site preparation, assembly, and secure placement. Includes comprehensive labor, rough materials, equipment usage, and fire pit components (client's choice of kit and design). Ensures a functional and aesthetically pleasing fire pit setup.",
                  "unit_of_measurement": "each"
                },
                "22.3.2": {
                  "activity": "Seat Wall Installation",
                  "description": "Installation of a seat wall around a fire pit or in a garden area. This service includes site preparation, wall construction, and secure placement. Includes comprehensive labor, rough materials, equipment usage, and seat wall components (client's choice of materials and design). Ensures a comfortable and durable seating solution.",
                  "unit_of_measurement": "each"
                },
                "22.3.3": {
                  "activity": "Fire Pit Cleaning",
                  "description": "Thorough cleaning of a fire pit to maintain safety and functionality. This service includes ash removal, surface cleaning, and inspection of fire pit components. Includes comprehensive labor, rough materials, and necessary cleaning equipment. Ensures the fire pit is clean and ready for safe use.",
                  "unit_of_measurement": "each"
                },
                "22.3.4": {
                  "activity": "Fire Pit Removal",
                  "description": "Safe removal of a fire pit. This service includes disassembly of the fire pit components and site cleanup. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures efficient and clean removal of the fire pit.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "22.4": {
              "category": "Fireplace",
              "activities": {
                "22.4.1": {
                  "activity": "Compact Outdoor Fireplace Installation",
                  "description": "Installation of a compact outdoor fireplace to enhance outdoor living spaces. This service includes site preparation, fireplace assembly, and secure mounting. Includes comprehensive labor, rough materials, equipment usage, and fireplace components (client's choice of model and specifications). Ensures a functional and aesthetically pleasing outdoor fireplace setup.",
                  "unit_of_measurement": "each"
                },
                "22.4.2": {
                  "activity": "Compact Wood Box Installation",
                  "description": "Installation of a compact wood box for convenient wood storage. This service includes site preparation, box assembly, and secure placement. Includes comprehensive labor, rough materials, equipment usage, and wood box components (client's choice of model and specifications). Ensures a practical and durable wood storage solution.",
                  "unit_of_measurement": "each"
                },
                "22.4.3": {
                  "activity": "Compact Outdoor Hearth Installation",
                  "description": "Installation of a compact outdoor hearth to complement a fireplace. This service includes site preparation, hearth construction, and secure placement. Includes comprehensive labor, rough materials, equipment usage, and hearth components (client's choice of materials and design). Ensures a functional and aesthetically pleasing hearth setup.",
                  "unit_of_measurement": "each"
                },
                "22.4.4": {
                  "activity": "Fireplace Cleaning",
                  "description": "Thorough cleaning of an outdoor fireplace to maintain safety and efficiency. This service includes ash removal, surface cleaning, and inspection of fireplace components. Includes comprehensive labor, rough materials, and necessary cleaning equipment. Ensures the fireplace is clean and ready for safe use.",
                  "unit_of_measurement": "each"
                },
                "22.4.5": {
                  "activity": "Fireplace Removal",
                  "description": "Safe removal of an outdoor fireplace. This service includes disassembly of fireplace components and site cleanup. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures efficient and clean removal of the fireplace.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "22.5": {
              "category": "Patio Heater",
              "activities": {
                "22.5.1": {
                  "activity": "Ceiling-Mounted Electric Heater Installation",
                  "description": "Installation of an infrared ceiling-mounted electric heater for efficient outdoor heating. This service includes site preparation, heater mounting, and electrical connections. Includes comprehensive labor, rough materials, equipment usage, and heater components (client's choice of model and specifications). Ensures effective and reliable outdoor heating.",
                  "unit_of_measurement": "each"
                },
                "22.5.2": {
                  "activity": "Infrared Electric Heater Replacement",
                  "description": "Replacement of an existing infrared electric heater with a new model. This service includes removal of the old heater, installation of the new heater, and electrical connections. Includes comprehensive labor, rough materials, equipment usage, and heater components (client's choice of model and specifications). Ensures continued efficient outdoor heating.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "22.6": {
              "category": "Hot Tubs",
              "activities": {
                "22.6.1": {
                  "activity": "Hot Tub Installation",
                  "description": "Installation of a hot tub to enhance outdoor relaxation. This service includes site preparation, hot tub placement, plumbing and electrical connections, and testing. Includes comprehensive labor, rough materials, equipment usage, and hot tub components (client's choice of model and specifications). Ensures a functional and enjoyable hot tub setup.",
                  "unit_of_measurement": "each"
                },
                "22.6.2": {
                  "activity": "Hot Tub Maintenance",
                  "description": "Regular maintenance of a hot tub to ensure optimal performance and cleanliness. This service includes water treatment, filter cleaning or replacement, and inspection of hot tub components. Includes comprehensive labor, rough materials, and necessary maintenance equipment. Ensures the hot tub is clean, safe, and ready for use.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "22.7": {
              "category": "Pool",
              "activities": {
                "22.7.1": {
                  "activity": "Swimming Pool Site Preparation",
                  "description": "Preparation of the site for swimming pool installation. This service includes excavation, leveling, and ground preparation. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures the site is ready for pool installation.",
                  "unit_of_measurement": "sq ft"
                },
                "22.7.2": {
                  "activity": "Hard-Sided Swimming Pool Installation",
                  "description": "Installation of a hard-sided swimming pool. This service includes pool assembly, placement, plumbing, and electrical connections. Includes comprehensive labor, rough materials, equipment usage, and pool components (client's choice of model and specifications). Ensures a secure and functional pool setup.",
                  "unit_of_measurement": "each"
                },
                "22.7.3": {
                  "activity": "Frame Swimming Pool Installation",
                  "description": "Installation of a frame swimming pool. This service includes pool frame assembly, liner placement, plumbing, and electrical connections. Includes comprehensive labor, rough materials, equipment usage, and pool components (client's choice of model and specifications). Ensures a secure and functional pool setup.",
                  "unit_of_measurement": "each"
                },
                "22.7.4": {
                  "activity": "Cartridge Pool Filter Replacement",
                  "description": "Replacement of the cartridge pool filter to maintain water cleanliness. This service includes removal of the old filter, installation of the new filter, and system testing. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures the pool filtration system is effective.",
                  "unit_of_measurement": "each"
                },
                "22.7.5": {
                  "activity": "Outdoor Pool Pump Replacement",
                  "description": "Replacement of the outdoor pool pump to ensure proper water circulation. This service includes removal of the old pump, installation of the new pump, and system testing. Includes comprehensive labor, rough materials, equipment usage, and pump components (client's choice of model and specifications). Ensures the pool pump is functioning efficiently.",
                  "unit_of_measurement": "each"
                },
                "22.7.6": {
                  "activity": "Outdoor Pool Winterization",
                  "description": "Winterization of the outdoor pool to protect it during the cold season. This service includes water drainage, plumbing system preparation, and covering the pool. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures the pool is properly prepared for winter.",
                  "unit_of_measurement": "each"
                },
                "22.7.7": {
                  "activity": "Outdoor Pool Opening",
                  "description": "Opening of the outdoor pool for the summer season. This service includes uncovering the pool, plumbing system preparation, water treatment, and system testing. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures the pool is ready for use.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "22.8": {
              "category": "Refrigeration",
              "activities": {
                "22.8.1": {
                  "activity": "Built-In Outdoor Cooler Installation",
                  "description": "Installation of a built-in outdoor cooler for convenient outdoor refrigeration. This service includes site preparation, cooler installation, and electrical connections. Includes comprehensive labor, rough materials, equipment usage, and cooler components (client's choice of model and specifications). Ensures a functional and efficient outdoor cooler setup.",
                  "unit_of_measurement": "each"
                },
                "22.8.2": {
                  "activity": "Outdoor Refrigeration Electrical Repair",
                  "description": "Electrical repair of outdoor refrigeration systems. This service includes diagnosis of electrical issues, repair of wiring and components, and system testing. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures the refrigeration system is functioning properly.",
                  "unit_of_measurement": "each"
                },
                "22.8.3": {
                  "activity": "Outdoor Refrigeration System Maintenance",
                  "description": "Regular maintenance of outdoor refrigeration systems to ensure optimal performance. This service includes inspection, cleaning, and testing of components. Includes comprehensive labor, rough materials, and necessary maintenance equipment. Ensures the refrigeration system is well-maintained and efficient.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "22.9": {
              "category": "Outdoor Cooling",
              "activities": {
                "22.9.1": {
                  "activity": "Cooling System for Small to Midsize Patio Installation",
                  "description": "Installation of an outdoor mist cooling system for small to midsize patios. This service includes site preparation, system assembly, and plumbing connections. Includes comprehensive labor, rough materials, equipment usage, and cooling system components (client's choice of model and specifications). Ensures a comfortable and cool patio environment.",
                  "unit_of_measurement": "each"
                },
                "22.9.2": {
                  "activity": "Cooling System for Mid to Large Patio Installation",
                  "description": "Installation of an outdoor mist cooling system for mid to large patios. This service includes site preparation, system assembly, and plumbing connections. Includes comprehensive labor, rough materials, equipment usage, and cooling system components (client's choice of model and specifications). Ensures a comfortable and cool patio environment.",
                  "unit_of_measurement": "each"
                }
              }
            }
          }
        }
      },
      {
        "23": {
          "section": "Facade",
          "categories": {
            "23.1": {
              "category": "Wood Siding",
              "activities": {
                "23.1.1": {
                  "activity": "Wooden Clapboard Siding Installation on a Single-Story Building",
                  "description": "Installation of wooden clapboard siding on a single-story building. This service includes site preparation, siding attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and siding materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing wood siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.1.2": {
                  "activity": "Wooden Clapboard Siding Installation on 2-3 Story Building",
                  "description": "Installation of wooden clapboard siding on a 2-3 story building. This service includes site preparation, siding attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and siding materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing wood siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.1.3": {
                  "activity": "Cedar Wood Shingle Siding Installation on a Single-Story Building",
                  "description": "Installation of cedar wood shingle siding on a single-story building. This service includes site preparation, shingle attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and shingle materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing wood shingle siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.1.4": {
                  "activity": "Cedar Wood Shingle Siding Installation on a 2-3 Story Building",
                  "description": "Installation of cedar wood shingle siding on a 2-3 story building. This service includes site preparation, siding attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and shingle materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing wood shingle siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.1.5": {
                  "activity": "Plywood Siding Panel Installation on a Single-Story Building",
                  "description": "Installation of plywood siding panels on a single-story building. This service includes site preparation, panel attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and siding materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing plywood siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.1.6": {
                  "activity": "Plywood Siding Panel Installation on a 2-3 Story Building",
                  "description": "Installation of plywood siding panels on a 2-3 story building. This service includes site preparation, panel attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and siding materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing plywood siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.1.7": {
                  "activity": "Grid Siding Board Installation on a Single-Story Building",
                  "description": "Installation of grid siding boards on a single-story building. This service includes site preparation, board attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and siding materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing grid siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.1.8": {
                  "activity": "Grid Siding Board Installation on a 2-3 Story Building",
                  "description": "Installation of grid siding boards on a 2-3 story building. This service includes site preparation, board attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and siding materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing grid siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.1.9": {
                  "activity": "Wood Siding Removal",
                  "description": "Removal of existing wood siding. This service includes careful detachment of siding, disposal of old materials, and site cleanup. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures the safe and efficient removal of wood siding.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.2": {
              "category": "Vinyl Siding",
              "activities": {
                "23.2.1": {
                  "activity": "Vinyl Siding Installation on a Single-Story Building",
                  "description": "Installation of vinyl siding on a single-story building. This service includes site preparation, siding attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and vinyl siding materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing vinyl siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.2.2": {
                  "activity": "Vinyl Siding Installation on a 2-3 Story Building",
                  "description": "Installation of vinyl siding on a 2-3 story building. This service includes site preparation, siding attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and vinyl siding materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing vinyl siding installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.2.3": {
                  "activity": "Vinyl Siding Repair",
                  "description": "Repair of damaged vinyl siding. This service includes assessment, removal of damaged sections, and replacement with new vinyl siding. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures effective and seamless repair of vinyl siding.",
                  "unit_of_measurement": "sq ft"
                },
                "23.2.4": {
                  "activity": "Vinyl Siding Removal",
                  "description": "Removal of existing vinyl siding. This service includes careful detachment of siding, disposal of old materials, and site cleanup. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures the safe and efficient removal of vinyl siding.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.3": {
              "category": "Brick Veneer",
              "activities": {
                "23.3.1": {
                  "activity": "Thin Brick Veneer Removal",
                  "description": "Removal of thin brick veneer. This service includes careful detachment of veneer, disposal of old materials, and site cleanup. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures the safe and efficient removal of thin brick veneer.",
                  "unit_of_measurement": "sq ft"
                },
                "23.3.2": {
                  "activity": "Thin Brick Veneer Installation on a Single-Story Building",
                  "description": "Installation of thin brick veneer on a single-story building. This service includes site preparation, veneer attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and thin brick veneer materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing brick veneer installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.3.3": {
                  "activity": "Thin Brick Veneer Installation on a 2-3 Story Building",
                  "description": "Installation of thin brick veneer on a 2-3 story building. This service includes site preparation, veneer attachment, and finishing. Includes comprehensive labor, rough materials, equipment usage, and thin brick veneer materials (client's choice of type and specifications). Ensures a durable and aesthetically pleasing brick veneer installation.",
                  "unit_of_measurement": "sq ft"
                },
                "23.3.4": {
                  "activity": "Brick Veneer Sealing",
                  "description": "Sealing of brick veneer to protect against moisture and staining. This service includes cleaning, application of sealant, and drying. Includes comprehensive labor, rough materials, equipment usage, and sealant materials (client's choice of type and specifications). Ensures enhanced durability and appearance of brick veneer.",
                  "unit_of_measurement": "sq ft"
                },
                "23.3.5": {
                  "activity": "Brick Veneer Pointing and Repointing",
                  "description": "Pointing and repointing of brick veneer joints to maintain structural integrity and appearance. This service includes removal of old mortar, cleaning, and application of new mortar. Includes comprehensive labor, rough materials, equipment usage, and mortar materials (client's choice of type and specifications). Ensures a durable and visually appealing brick veneer finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.3.6": {
                  "activity": "Brick Veneer Damage Repair",
                  "description": "Repair of damaged brick veneer sections. This service includes assessment, removal of damaged bricks, and replacement with new bricks. Includes comprehensive labor, rough materials, and necessary equipment usage. Ensures effective and seamless repair of brick veneer.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.4": {
              "category": "Stone Cladding",
              "activities": {
                "23.4.1": {
                  "activity": "Old Cladding Removal",
                  "description": "Safe and efficient removal of old cladding materials from building exteriors, ensuring the underlying structure is not damaged. This service includes comprehensive labor, the use of appropriate tools and equipment, and responsible disposal of old materials.",
                  "unit_of_measurement": "sq ft"
                },
                "23.4.2": {
                  "activity": "Stone Cladding Surface Preparation",
                  "description": "Preparing surfaces for new stone cladding installation by cleaning, repairing any damage, and applying a suitable primer. This service includes comprehensive labor, the use of necessary equipment, and application of primer and other preparatory materials.",
                  "unit_of_measurement": "sq ft"
                },
                "23.4.3": {
                  "activity": "Natural Stone Installation on a Single-Story Building",
                  "description": "Installing natural stone cladding on a single-story building to provide a durable and aesthetically pleasing exterior. This service includes comprehensive labor, rough materials, equipment usage, and natural stone materials (client's choice of type and specifications). Ensures a professional and long-lasting finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.4.4": {
                  "activity": "Natural Stone Installation on a 2-3 Story Building",
                  "description": "Installing natural stone cladding on a 2-3 story building to enhance its durability and appearance. This service includes comprehensive labor, rough materials, equipment usage, and natural stone materials (client's choice of type and specifications). Ensures a professional and long-lasting finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.4.5": {
                  "activity": "Manufactured Stone Veneer Installation on a Single-Story Building",
                  "description": "Installing manufactured stone veneer on a single-story building to achieve the look of natural stone with little maintenance. This service includes comprehensive labor, rough materials, equipment usage, and manufactured stone veneer materials (client's choice of type and specifications). Ensures a durable and attractive finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.4.6": {
                  "activity": "Manufactured Stone Veneer Installation on a 2-3 Story Building",
                  "description": "Installing manufactured stone veneer on a 2-3 story building to provide a lightweight yet durable exterior. This service includes comprehensive labor, rough materials, equipment usage, and manufactured stone veneer materials (client's choice of type and specifications). Ensures a durable and attractive finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.4.7": {
                  "activity": "Faux Stone Siding Installation on a Single-Story Building",
                  "description": "Installing faux stone siding on a single-story building to mimic the appearance of natural stone with easy-install materials. This service includes comprehensive labor, rough materials, equipment usage, and faux stone siding materials (client's choice of type and specifications). Ensures a professional and appealing finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.4.8": {
                  "activity": "Faux Stone Siding Installation on a 2-3 Story Building",
                  "description": "Installing faux stone siding on a 2-3 story building to achieve the look of natural stone with less weight and cost. This service includes comprehensive labor, rough materials, equipment usage, and faux stone siding materials (client's choice of type and specifications). Ensures a professional and appealing finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.4.9": {
                  "activity": "Stone Cladding Column Wrap",
                  "description": "Wrapping columns with stone cladding for a decorative and protective finish, enhancing the architectural details. This service includes comprehensive labor, rough materials, equipment usage, and stone cladding materials (client's choice of type and specifications). Ensures a professional and attractive appearance.",
                  "unit_of_measurement": "each"
                },
                "23.4.10": {
                  "activity": "Stone Cladding Protective Sealants Application",
                  "description": "Applying protective sealants to stone cladding to enhance durability, resistance to weathering, and longevity of the finish. This service includes comprehensive labor, rough materials, equipment usage, and sealant materials (client's choice of type and specifications). Ensures extended life and appearance of stone cladding.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.5": {
              "category": "Stucco",
              "activities": {
                "23.5.1": {
                  "activity": "Traditional Stucco Application on a Single-Story Building",
                  "description": "Applying traditional stucco on a single-story building to provide a textured and durable exterior finish. This service includes comprehensive labor, rough materials, equipment usage, and stucco materials (client's choice of type and specifications). Ensures a durable and attractive finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.5.2": {
                  "activity": "Traditional Stucco Application on a 2-3 Story Building",
                  "description": "Applying traditional stucco on a 2-3 story building to achieve a textured and durable exterior. This service includes comprehensive labor, rough materials, equipment usage, and stucco materials (client's choice of type and specifications). Ensures a durable and attractive finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.5.3": {
                  "activity": "Old Stucco Removal on a Single-Story Building",
                  "description": "Safe and efficient removal of old stucco from a single-story building, preparing the surface for new applications. This service includes comprehensive labor, use of appropriate tools and equipment, and responsible disposal of old materials.",
                  "unit_of_measurement": "sq ft"
                },
                "23.5.4": {
                  "activity": "Old Stucco Removal on a 2-3 Story Building",
                  "description": "Safe and efficient removal of old stucco from a 2-3 story building, ensuring the surface is properly prepared for new applications. This service includes comprehensive labor, use of appropriate tools and equipment, and responsible disposal of old materials.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.6": {
              "category": "Metal Cladding",
              "activities": {
                "23.6.1": {
                  "activity": "Galvanized Steel Panel Installation",
                  "description": "Installation of galvanized steel panels for a durable and weather-resistant exterior. This service includes comprehensive labor, rough materials, equipment usage, and galvanized steel panels (client's choice of type and specifications). Ensures a strong and long-lasting cladding.",
                  "unit_of_measurement": "sq ft"
                },
                "23.6.2": {
                  "activity": "Old Cladding Removal",
                  "description": "Safe and efficient removal of old cladding materials to prepare the surface for new installation. This service includes comprehensive labor, use of appropriate tools and equipment, and responsible disposal of old materials.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.7": {
              "category": "Glass Facades",
              "activities": {
                "23.7.1": {
                  "activity": "Glass Blocks Installation",
                  "description": "Installation of glass blocks to enhance the aesthetics and light diffusion of a building. This service includes comprehensive labor, rough materials, equipment usage, and glass blocks (client's choice of type and specifications). Ensures a visually appealing and functional glass facade.",
                  "unit_of_measurement": "sq ft"
                },
                "23.7.2": {
                  "activity": "Glass Blocks Removal",
                  "description": "Safe and efficient removal of glass blocks, preparing the area for new installations or other applications. This service includes comprehensive labor, use of appropriate tools and equipment, and responsible disposal of old materials.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.8": {
              "category": "Composite Paneling",
              "activities": {
                "23.8.1": {
                  "activity": "Composite Siding Installation on a Single-Story Building",
                  "description": "Installation of composite siding on a single-story building for a modern and durable exterior. This service includes comprehensive labor, rough materials, equipment usage, and composite siding (client's choice of type and specifications). Ensures a professional and long-lasting finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.8.2": {
                  "activity": "Composite Siding Installation on a 2-3 Story Building",
                  "description": "Installation of composite siding on a 2-3 story building to enhance its appearance and durability. This service includes comprehensive labor, rough materials, equipment usage, and composite siding (client's choice of type and specifications). Ensures a professional and long-lasting finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.8.3": {
                  "activity": "Fiber Cement Siding Installation on a Single Story Building",
                  "description": "Installation of fiber cement siding on a single-story building for a resilient and attractive exterior. This service includes comprehensive labor, rough materials, equipment usage, and fiber cement siding (client's choice of type and specifications). Ensures a durable and appealing finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.8.4": {
                  "activity": "Fiber Cement Siding Installation on a 2-3 Story Building",
                  "description": "Installation of fiber cement siding on a 2-3 story building to provide a durable and visually appealing exterior. This service includes comprehensive labor, rough materials, equipment usage, and fiber cement siding (client's choice of type and specifications). Ensures a durable and appealing finish.",
                  "unit_of_measurement": "sq ft"
                },
                "23.8.5": {
                  "activity": "Composite Paneling Removal on a Single-Story Building",
                  "description": "Safe and efficient removal of composite paneling from a single-story building, preparing the surface for new applications. This service includes comprehensive labor, use of appropriate tools and equipment, and responsible disposal of old materials.",
                  "unit_of_measurement": "sq ft"
                },
                "23.8.6": {
                  "activity": "Composite Paneling Removal on a 2-3 Story Building",
                  "description": "Safe and efficient removal of composite paneling from a 2-3 story building, preparing the surface for new applications. This service includes comprehensive labor, use of appropriate tools and equipment, and responsible disposal of old materials.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.9": {
              "category": "Trims and moldings",
              "activities": {
                "23.9.1": {
                  "activity": "Fiber Cement Trim Board Installation on a Single-Story Building",
                  "description": "Installation of fiber cement trim boards on a single-story building to enhance its architectural detail and durability. This service includes comprehensive labor, rough materials, equipment usage, and fiber cement trim boards (client's choice of type and specifications). Ensures a professional and attractive finish.",
                  "unit_of_measurement": "lin ft"
                },
                "23.9.2": {
                  "activity": "Fiber Cement Trim Board Installation on a 2-3 Story Building",
                  "description": "Installation of fiber cement trim boards on a 2-3 story building to provide detailed and durable architectural accents. This service includes comprehensive labor, rough materials, equipment usage, and fiber cement trim boards (client's choice of type and specifications). Ensures a professional and attractive finish.",
                  "unit_of_measurement": "lin ft"
                },
                "23.9.3": {
                  "activity": "Engineered Treated Wood Siding Installation on a Single-Story Building",
                  "description": "Installation of engineered treated wood trim on a single-story building for a durable and aesthetically pleasing finish. This service includes comprehensive labor, rough materials, equipment usage, and treated wood trim (client's choice of type and specifications). Ensures a professional and long-lasting finish.",
                  "unit_of_measurement": "lin ft"
                },
                "23.9.4": {
                  "activity": "Engineered Treated Wood Siding Installation on a 2-3 Story Building",
                  "description": "Installation of engineered treated wood trim on a 2-3 story building to enhance its durability and appearance. This service includes comprehensive labor, rough materials, equipment usage, and treated wood trim (client's choice of type and specifications). Ensures a professional and long-lasting finish.",
                  "unit_of_measurement": "lin ft"
                },
                "23.9.5": {
                  "activity": "PVC Trim Installation on a Single-Story Building",
                  "description": "Installation of PVC trim on a single-story building for a low-maintenance and durable exterior finish. This service includes comprehensive labor, rough materials, equipment usage, and PVC trim (client's choice of type and specifications). Ensures a professional and long-lasting finish.",
                  "unit_of_measurement": "lin ft"
                },
                "23.9.6": {
                  "activity": "PVC Trim Installation on a 2-3 Story Building",
                  "description": "Installation of PVC trim on a 2-3 story building to provide a durable and low-maintenance finish. This service includes comprehensive labor, rough materials, equipment usage, and PVC trim (client's choice of type and specifications). Ensures a professional and long-lasting finish.",
                  "unit_of_measurement": "lin ft"
                },
                "23.9.7": {
                  "activity": "Custom bent aluminum Installation",
                  "description": "Installation of custom bent aluminum trim to provide detailed and durable architectural accents. This service includes comprehensive labor, rough materials, equipment usage, and custom aluminum trim (client's choice of type and specifications). Ensures a professional and precise finish.",
                  "unit_of_measurement": "lin ft"
                },
                "23.9.8": {
                  "activity": "Texture Soffit Installation",
                  "description": "Installation of textured soffit panels to enhance the architectural detail and ventilation of a building. This service includes comprehensive labor, rough materials, equipment usage, and soffit panels (client's choice of type and specifications). Ensures a professional and functional finish.",
                  "unit_of_measurement": "lin ft"
                },
                "23.9.9": {
                  "activity": "Trim and Molding Removal",
                  "description": "Safe and efficient removal of old trim and molding, preparing the surface for new applications. This service includes comprehensive labor, use of appropriate tools and equipment, and responsible disposal of old materials.",
                  "unit_of_measurement": "lin ft"
                }
              }
            },
            "23.10": {
              "category": "Underlayment",
              "activities": {
                "23.10.1": {
                  "activity": "House Wrap Installation",
                  "description": "Installation of house wrap to provide a moisture barrier and improve energy efficiency. This service includes comprehensive labor, rough materials, equipment usage, and house wrap (client's choice of type and specifications). Ensures a professional and effective installation for enhanced protection.",
                  "unit_of_measurement": "sq ft"
                },
                "23.10.2": {
                  "activity": "House Wrap Removal",
                  "description": "Safe and efficient removal of old house wrap, preparing the surface for new applications. This service includes comprehensive labor, use of appropriate tools and equipment, and responsible disposal of old materials.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.11": {
              "category": "Pest Control",
              "activities": {
                "23.11.1": {
                  "activity": "Perimeter Bug Barrier Installation",
                  "description": "Installation of a bug barrier around the perimeter of the building to prevent insect infestations. This service includes comprehensive labor, rough materials, equipment usage, and bug barrier materials (client's choice of type and specifications). Ensures a professional and effective pest control solution.",
                  "unit_of_measurement": "sq ft"
                },
                "23.11.2": {
                  "activity": "Bird Spikes Installation",
                  "description": "Installation of bird spikes to deter birds from landing and nesting on building surfaces. This service includes comprehensive labor, rough materials, equipment usage, and bird spikes (client's choice of type and specifications). Ensures a professional and effective bird control solution.",
                  "unit_of_measurement": "lin ft"
                },
                "23.11.3": {
                  "activity": "Screening Installation",
                  "description": "Installation of screening to prevent insects and debris from entering the building. This service includes comprehensive labor, rough materials, equipment usage, and screening materials (client's choice of type and specifications). Ensures a professional and effective screening solution.",
                  "unit_of_measurement": "sq ft"
                },
                "23.11.4": {
                  "activity": "Screening Replacement",
                  "description": "Safe and efficient replacement of damaged or old screening, improving protection against insects and debris. This service includes comprehensive labor, rough materials, equipment usage, and screening materials (client's choice of type and specifications). Ensures a professional and effective replacement.",
                  "unit_of_measurement": "sq ft"
                }
              }
            },
            "23.12": {
              "category": "Maintenance",
              "activities": {
                "23.12.1": {
                  "activity": "Routine Facade Inspections",
                  "description": "Regular inspections of the building Facade to identify and address potential issues. This service includes comprehensive labor, use of appropriate tools and equipment, and detailed inspection reports. Ensures early detection and maintenance of Facade integrity.",
                  "unit_of_measurement": "sq ft"
                },
                "23.12.2": {
                  "activity": "Facade Structural Assessment",
                  "description": "Comprehensive assessment of the structural integrity of the building Facade. This service includes comprehensive labor, use of appropriate tools and equipment, and detailed assessment reports. Ensures a thorough evaluation and maintenance plan.",
                  "unit_of_measurement": "sq ft"
                },
                "23.12.3": {
                  "activity": "Graffiti Removal",
                  "description": "Safe and effective removal of graffiti from building surfaces. This service includes comprehensive labor, use of appropriate tools and cleaning agents, and responsible disposal of removed materials. Ensures a clean and professional appearance.",
                  "unit_of_measurement": "sq ft"
                },
                "23.12.4": {
                  "activity": "Concrete & Masonry Waterproofing",
                  "description": "Application of waterproofing solutions to concrete and masonry surfaces to protect against moisture damage. This service includes comprehensive labor, rough materials, equipment usage, and waterproofing products (client's choice of type and specifications). Ensures enhanced durability and protection.",
                  "unit_of_measurement": "sq ft"
                },
                "23.12.5": {
                  "activity": "Exterior Wood Facade Waterproofing",
                  "description": "Application of waterproofing solutions to exterior wood surfaces to protect against moisture damage. This service includes comprehensive labor, rough materials, equipment usage, and waterproofing products (client's choice of type and specifications). Ensures enhanced durability and protection.",
                  "unit_of_measurement": "sq ft"
                },
                "23.12.6": {
                  "activity": "Protection Facade Against Moisture",
                  "description": "Comprehensive moisture protection solutions for building facades to prevent water infiltration and damage. This service includes comprehensive labor, rough materials, equipment usage, and moisture protection products (client's choice of type and specifications). Ensures enhanced durability and protection.",
                  "unit_of_measurement": "sq ft"
                }
              }
            }
          }
        }
      },
      {
        "24": {
          "section": "Security",
          "categories": {
            "24.1": {
              "category": "CCTV",
              "activities": {
                "24.1.1": {
                  "activity": "4 WiFi Security Camera System with Monitor Installation",
                  "description": "Installation of a 4-camera WiFi security system with a monitor for enhanced surveillance. This service includes mounting cameras, connecting to the WiFi network, and setting up the monitor. Comprehensive labor, rough materials, equipment usage, and security cameras with monitor (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                },
                "24.1.2": {
                  "activity": "8 WiFi Security Camera System with Monitor Installation",
                  "description": "Installation of an 8-camera WiFi security system with a monitor for extended coverage. This service includes mounting cameras, connecting to the WiFi network, and setting up the monitor. Comprehensive labor, rough materials, equipment usage, and security cameras with monitor (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                },
                "24.1.3": {
                  "activity": "Security Camera System with Human & Vehicle Detection Installation",
                  "description": "Installation of a 16-camera security system with advanced human and vehicle detection capabilities. This service includes mounting cameras, connecting to the network, and configuring detection features. Comprehensive labor, rough materials, equipment usage, and security cameras with detection system (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "24.2": {
              "category": "Wireless Cameras",
              "activities": {
                "24.2.1": {
                  "activity": "Battery-Powered Wireless Smart Home Security Camera Installation",
                  "description": "Installation of a battery-powered wireless security camera for smart home integration. This service includes mounting the camera, connecting to the wireless network, and configuring smart features. Comprehensive labor, rough materials, equipment usage, and wireless security camera (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                },
                "24.2.2": {
                  "activity": "Small Solar Panel for Outdoor Cameras Installation",
                  "description": "Installation of a small solar panel to power outdoor security cameras. This service includes mounting the solar panel and connecting it to the camera system. Comprehensive labor, rough materials, equipment usage, and solar panel (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                },
                "24.2.3": {
                  "activity": "Gutter Mount Security Camera and Solar Panel Installation",
                  "description": "Installation of a gutter mount security camera and solar panel for optimal placement and power supply. This service includes mounting the camera and solar panel on the gutter and connecting them. Comprehensive labor, rough materials, equipment usage, and security camera with solar panel (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                },
                "24.2.4": {
                  "activity": "Maintenance (battery replacement, cleaning)",
                  "description": "Regular maintenance of wireless security cameras, including battery replacement and cleaning. This service ensures the cameras remain functional and provide clear footage. Comprehensive labor, rough materials, and equipment usage are included.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "24.3": {
              "category": "Security Alarms",
              "activities": {
                "24.3.1": {
                  "activity": "Motion-Sensing Security Alarm Installation",
                  "description": "Installation of a motion-sensing security alarm for enhanced home security. This service includes mounting the alarm and connecting it to the security system. Comprehensive labor, rough materials, equipment usage, and motion-sensing alarm (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                },
                "24.3.2": {
                  "activity": "Door/Window Alarm Installation",
                  "description": "Installation of door and window alarms to detect unauthorized entry. This service includes mounting alarms on doors and windows and connecting them to the security system. Comprehensive labor, rough materials, equipment usage, and door/window alarms (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                },
                "24.3.3": {
                  "activity": "Wireless Security System, 14 Piece Installation",
                  "description": "Installation of a 14-piece wireless security system for comprehensive home protection. This service includes mounting and configuring all components of the security system. Comprehensive labor, rough materials, equipment usage, and wireless security system (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "24.4": {
              "category": "Doorbell Cameras",
              "activities": {
                "24.4.1": {
                  "activity": "Video Doorbell Installation",
                  "description": "Installation of a video doorbell for enhanced entryway monitoring. This service includes mounting the doorbell, connecting to the network, and configuring the system. Comprehensive labor, rough materials, equipment usage, and video doorbell (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                },
                "24.4.2": {
                  "activity": "Maintenance and Battery Pack Replacement",
                  "description": "Regular maintenance and battery pack replacement for video doorbells to ensure continuous operation. Comprehensive labor, rough materials, and equipment usage are included.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "24.5": {
              "category": "Biometric Access",
              "activities": {
                "24.5.1": {
                  "activity": "Fingerprint WiFi Smart Lock Installation",
                  "description": "Installation of a fingerprint WiFi smart lock for secure and convenient access control. This service includes mounting the lock, connecting to the WiFi network, and configuring fingerprint access. Comprehensive labor, rough materials, equipment usage, and fingerprint WiFi smart lock (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                },
                "24.5.2": {
                  "activity": "Over Existing Deadbolt Smart Lock Installation",
                  "description": "Installation of a smart lock over an existing deadbolt for added security and smart access features. This service includes mounting the smart lock and configuring it. Comprehensive labor, rough materials, equipment usage, and smart lock (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                }
              }
            },
            "24.6": {
              "category": "Keypad Access",
              "activities": {
                "24.6.1": {
                  "activity": "Smart Door Lock with Bluetooth and Pushbutton Keypad Installation",
                  "description": "Installation of a smart door lock with Bluetooth and pushbutton keypad for secure and flexible access control. This service includes mounting the lock, connecting to the network, and configuring keypad access. Comprehensive labor, rough materials, equipment usage, and smart door lock (client's choice of model and specifications) are included.",
                  "unit_of_measurement": "each"
                }
              }
            }
          }
        }
      }
    ]
  }
}
